
 <!DOCTYPE HTML>
<html lang="libing2012.guo@gmail.com">
<head>
  <meta charset="UTF-8">
  
    <title>天生爱跑</title>
    <meta name="viewport" content="width=device-width, initial-scale=1,user-scalable=no">
    
    <meta name="author" content="EdwardGuo">
    

    
    <meta name="description">
<meta property="og:type" content="website">
<meta property="og:title" content="天生爱跑">
<meta property="og:url" content="http://yoursite.com/index.html">
<meta property="og:site_name" content="天生爱跑">
<meta property="og:description">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="天生爱跑">
<meta name="twitter:description">

    
    <link rel="alternative" href="/atom.xml" title="天生爱跑" type="application/atom+xml">
    
    
    <link rel="icon" href="/img/favicon.ico">
    
    
    <link rel="apple-touch-icon" href="/img/golden.jpg">
    <link rel="apple-touch-icon-precomposed" href="/img/golden.jpg">
    
    <link rel="stylesheet" href="/css/style.css" type="text/css">
</head>

  <body>
    <header>
      
<div>
		
			<div id="imglogo">
				<a href="/"><img src="/img/logo.png" alt="天生爱跑" title="天生爱跑"/></a>
			</div>
			
			<div id="textlogo">
				<h1 class="site-name"><a href="/" title="天生爱跑">天生爱跑</a></h1>
				<h2 class="blog-motto"></h2>
			</div>
			<div class="navbar"><a class="navbutton navmobile" href="#" title="菜單">
			</a></div>
			<nav class="animated">
				<ul>
					<ul>
					 
						<li><a href="/">Home</a></li>
					
						<li><a href="/archives">Archives</a></li>
					
						<li><a href="/about">About</a></li>
					
					<li>
 					
					<form class="search" action="//google.com/search" method="get" accept-charset="utf-8">
						<label>Search</label>
						<input type="search" id="search" name="q" autocomplete="off" maxlength="20" placeholder="搜索" />
						<input type="hidden" name="q" value="site:yoursite.com">
					</form>
					
					</li>
				</ul>
			</nav>			
</div>
    </header>
    <div id="container">
      <div id="main">

   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2016/05/08/Grace-From-TeTe/" title="Grace From TeTe" itemprop="url">Grace From TeTe</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="EdwardGuo" target="_blank" itemprop="author">EdwardGuo</a>
		
  <p class="article-time">
    <time datetime="2016-05-08T04:02:10.000Z" itemprop="datePublished"> 發表於 2016-05-08</time>
    
  </p>
</header>
    <div class="article-content">
        
        <pre><code>&#x4ECA;&#x5929;&#x770B;&#x670B;&#x53CB;&#x5708;&#x597D;&#x591A;&#x4EBA;&#x7ED9;&#x9EBB;&#x9EBB;&#x795D;&#x798F;&#xFF0C;&#x6211;&#x4E5F;&#x5E94;&#x8BE5;&#x8C22;&#x8C22;&#x9EBB;&#x9EBB;&#x3002;&#x867D;&#x7136;&#x6211;&#x662F;&#x53EA;&#x72D7;&#x72D7;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x5BF9;&#x9EBB;&#x9EBB;&#x5FC3;&#x5B58;&#x611F;&#x6FC0;&#xFF0C;&#x8C22;&#x8C22;&#x9EBB;&#x9EBB;&#x628A;&#x6211;&#x4ECE;2&#x4E2A;&#x6708;&#x7167;&#x987E;&#x5230;&#x73B0;&#x5728;&#xFF0C;&#x628A;&#x6211;&#x517B;&#x7684;&#x767D;&#x767D;&#x80D6;&#x80D6;&#xFF0C;&#x8FD9;&#x4E24;&#x5E74;&#xFF0C;&#x6211;&#x505A;&#x4E86;&#x5F88;&#x591A;&#x574F;&#x4E8B;&#xFF0C;&#x54AC;&#x574F;&#x4E86;&#x9EBB;&#x9EBB;&#x5F88;&#x591A;&#x978B;&#x5B50;&#xFF0C;&#x54AC;&#x574F;&#x4E86;&#x6C99;&#x53D1;&#xFF0C;&#x4E5F;&#x8DDF;&#x522B;&#x7684;&#x72D7;&#x6253;&#x8FC7;&#x67B6;&#xFF0C;&#x8BA9;&#x9EBB;&#x9EBB;&#x53D7;&#x4E86;&#x5F88;&#x591A;&#x59D4;&#x5C48;&#xFF0C;&#x9EBB;&#x9EBB;&#x5374;&#x4ECE;&#x6765;&#x6CA1;&#x6709;&#x653E;&#x5F03;&#x8FC7;&#x6211;&#xFF0C;&#x9EBB;&#x9EBB;&#x4F60;&#x4E3A;&#x6211;&#x4ED8;&#x51FA;&#x4E86;&#x8FD9;&#x4E48;&#x591A;&#x65F6;&#x95F4;&#xFF0C;&#x8FD9;&#x4E48;&#x591A;&#x7CBE;&#x529B;&#xFF0C;&#x8FD9;&#x4E9B;&#x6211;&#x4F1A;&#x4E00;&#x76F4;&#x8BB0;&#x5728;&#x5FC3;&#x91CC;&#x3002;
&#x767D;&#x5929;&#x4F60;&#x4E0D;&#x5728;&#x5BB6;&#x7684;&#x65F6;&#x5019;&#x6211;&#x5C31;&#x5728;&#x60F3;&#x9EBB;&#x9EBB;&#x662F;&#x4E0D;&#x662F;&#x4E0D;&#x8981;&#x6211;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x6BCF;&#x5929;&#x665A;&#x4E0A;&#x4F60;&#x90FD;&#x4F1A;&#x6309;&#x65F6;&#x56DE;&#x6765;&#xFF0C;&#x6BCF;&#x5929;&#x665A;&#x4E0A;&#x4F60;&#x56DE;&#x6765;&#x7684;&#x90A3;&#x4E00;&#x523B;&#x662F;&#x6211;&#x6700;&#x5F00;&#x5FC3;&#x7684;&#x4E00;&#x523B;&#xFF0C;&#x53EF;&#x80FD;&#x9EBB;&#x9EBB;&#x7684;&#x4E16;&#x754C;&#x91CC;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x4EBA;&#xFF0C;&#x4F46;&#x662F;&#x7279;&#x7279;&#x7684;&#x4E16;&#x754C;&#x91CC;&#x53EA;&#x6709;&#x4F60;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x56DE;&#x6765;&#x665A;&#x4E86;&#xFF0C;&#x7279;&#x7279;&#x4F1A;&#x6492;&#x5A07;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x62C5;&#x5FC3;&#x6709;&#x4E00;&#x5929;&#x4F60;&#x4F1A;&#x4E0D;&#x56DE;&#x6765;&#x4E86;&#x3002;
&#x9EBB;&#x9EBB;&#x6BCF;&#x5929;&#x90FD;&#x5728;&#x7528;&#x751F;&#x547D;&#x6E9C;&#x6211;&#xFF0C;&#x6211;&#x77E5;&#x9053;&#x6211;&#x529B;&#x6C14;&#x592A;&#x5927;&#x4E86;&#x4F60;&#x62C9;&#x4E0D;&#x4F4F;&#xFF0C;&#x4EE5;&#x540E;&#x6211;&#x4F1A;&#x6162;&#x70B9;&#x8D70;&#x7684;&#xFF0C;&#x6700;&#x540E;&#x5E0C;&#x671B;&#x9EBB;&#x9EBB;&#x611F;&#x5192;&#x5FEB;&#x70B9;&#x597D;&#x8D77;&#x6765;&#xFF0C;&#x8C22;&#x8C22;&#x9EBB;&#x9EBB;&#xFF01;

![logo](Grace-From-Tete/teteToW.jpg)
</code></pre>
        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">


</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2016/04/23/买车后你的生活有变化吗/" title="买车后你的生活有变化吗?" itemprop="url">买车后你的生活有变化吗?</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="EdwardGuo" target="_blank" itemprop="author">EdwardGuo</a>
		
  <p class="article-time">
    <time datetime="2016-04-23T10:48:52.000Z" itemprop="datePublished"> 發表於 2016-04-23</time>
    
  </p>
</header>
    <div class="article-content">
        
        <pre><code>2016&#x5E74;2&#x6708;&#x4EFD;&#x5728;&#x62B1;&#x7740;&#x4E9B;&#x8BB8;&#x62C5;&#x5FE7;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x4E70;&#x4E86;&#x8F66;&#xFF0C;&#x5F53;&#x521D;&#x6700;&#x4E3B;&#x8981;&#x7684;&#x62C5;&#x5FE7;&#x662F;&#x65E0;&#x5904;&#x505C;&#x8F66;&#xFF0C;&#x867D;&#x7136;&#x505C;&#x8F66;&#x786E;&#x5B9E;&#x9047;&#x5230;&#x4E86;&#x4E9B;&#x9EBB;&#x70E6;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x771F;&#x4E70;&#x8F66;&#x4E86;&#xFF0C;&#x8BE5;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;&#x90FD;&#x4F1A;&#x89E3;&#x51B3;&#x7684;&#xFF0C;
</code></pre><p> &#x505C;&#x8F66;&#x95EE;&#x9898;&#x6700;&#x540E;&#x8FD8;&#x662F;&#x5E78;&#x8FD0;&#x5730;&#x89E3;&#x51B3;&#x4E86;&#xFF0C;&#x4E0B;&#x9762;&#x4E70;&#x8F66;&#x540E;&#x751F;&#x6D3B;&#x7684;&#x53D8;&#x5316;&#x4EE5;&#x53CA;&#x5E0C;&#x671B;&#x8F66;&#x80FD;&#x7ED9;&#x81EA;&#x5DF1;&#x5E26;&#x6765;&#x54EA;&#x4E9B;&#x751F;&#x6D3B;&#x7684;&#x63D0;&#x9AD8;&#x3002;<br>     &#x53D8;&#x5316;&#x5982;&#x4E0B;&#xFF1A;<br>     1&#xFF09;&#x5BF9;&#x4E0A;&#x6D77;&#x7684;&#x4EA4;&#x901A;&#x66F4;&#x52A0;&#x719F;&#x6089;&#xFF0C;&#x4E5F;&#x80FD;&#x719F;&#x7EC3;&#x5730;&#x7A7F;&#x68AD;&#x4E8E;&#x5730;&#x9762;&#x548C;&#x9AD8;&#x67B6;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x719F;&#x6089;&#x4E86;&#x6C7D;&#x8F66;&#x7406;&#x8D54;&#xFF0C;&#x4FEE;&#x8F66;&#xFF0C;&#x907F;&#x514D;&#x4E8B;&#x6545;&#x7B49;&#x7B49;&#x3002;<br>     2&#xFF09;&#x5DE5;&#x4F5C;&#x4E4B;&#x4F59;&#x7684;&#x65F6;&#x95F4;&#x53EF;&#x4EE5;&#x53BB;&#x5F00;&#x5F00;&#x8F66;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5B85;&#x5728;&#x516C;&#x53F8;&#x6216;&#x5BB6;&#x91CC;&#xFF0C;&#x751F;&#x6D3B;&#x591A;&#x4E86;&#x4E9B;&#x4E50;&#x8DA3;&#xFF0C;&#x6BD5;&#x7ADF;&#x559C;&#x6B22;&#x5F00;&#x8F66;&#xFF0C;&#x559C;&#x6B22;&#x5728;&#x8F66;&#x91CC;&#x542C;&#x97F3;&#x4E50;(&#x82B1;4000&#x5757;&#x5347;&#x7EA7;&#x97F3;&#x54CD;&#x503C;)<br>     3) &#x665A;&#x4E0A;&#x6216;&#x5468;&#x672B;&#x53BB;&#x505A;&#x505A;&#x987A;&#x98CE;&#x8F66;&#xFF0C;&#x9047;&#x5230;&#x4E86;&#x5404;&#x79CD;&#x5404;&#x6837;&#x4E58;&#x5BA2;&#xFF0C;&#x57F9;&#x517B;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x5FCD;&#x8010;&#x529B;&#xFF0C;&#x4E5F;&#x591A;&#x4E86;&#x4E00;&#x4E2A;&#x8BA4;&#x8BC6;&#x670B;&#x53CB;&#x7684;&#x673A;&#x4F1A;&#x548C;&#x5E73;&#x53F0;&#xFF0C;&#x81EA;&#x5DF1;&#x7684;&#x5DE5;&#x4F5C;&#x548C;&#x751F;&#x6D3B;&#x5708;&#x5B50;&#x592A;&#x5C0F;&#xFF0C;&#x5F53;&#x7136;&#x987A;&#x98CE;&#x8F66;&#x8BA4;&#x8BC6;&#x670B;&#x53CB;&#x6982;&#x7387;&#x4E5F;&#x662F;&#x6781;&#x5C0F;&#x3002;<br>     4&#xFF09;&#x52A0;&#x73ED;&#x7684;&#x65F6;&#x95F4;&#x77ED;&#x4E86;&#xFF0C;&#x4E70;&#x8F66;&#x4E4B;&#x524D;&#x968F;&#x968F;&#x4FBF;&#x4FBF;&#x52A0;&#x73ED;&#x5230;11&#x70B9;&#xFF0C;&#x6709;&#x8F66;&#x4E4B;&#x540E;&#x4FBF;&#x60F3;&#x65E9;&#x70B9;&#x56DE;&#x5BB6;&#x5F00;&#x8F66;&#x3002;<br>     5&#xFF09;&#x5199;&#x535A;&#x5BA2;&#x548C;&#x770B;&#x4E66;&#x5B66;&#x4E60;&#x7684;&#x65F6;&#x95F4;&#x5C11;&#x4E86;&#xFF0C;&#x6709;&#x4E9B;&#x5F97;&#x4E0D;&#x507F;&#x5931;&#xFF0C;&#x8FD8;&#x662F;&#x9700;&#x8981;&#x5B89;&#x6392;&#x65F6;&#x95F4;&#x5B66;&#x4E60;&#x770B;&#x4E66;&#xFF0C;&#x5C11;&#x901B;&#x70B9;&#x6C7D;&#x8F66;&#x8BBA;&#x575B;&#xFF0C;&#x591A;&#x770B;&#x4E0B;&#x6E90;&#x4EE3;&#x7801;&#x3002;</p>
<pre><code>&#x5E0C;&#x671B;&#x8F66;&#x5E26;&#x6765;&#x7684;&#x4E9B;&#x53D8;&#x5316;
 1&#xFF09;&#x77ED;&#x9014;&#x65C5;&#x884C;&#x5F00;&#x8F66;&#x4F1A;&#x5F88;&#x65B9;&#x4FBF;&#x3002;
 2&#xFF09;&#x63D0;&#x9AD8;&#x5F00;&#x8F66;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x638C;&#x63E1;&#x8DEF;&#x51B5;&#x3002;
 3&#xFF09;&#x6210;&#x4E3A;&#x53E6;&#x4E00;&#x534A;&#x7684;&#x4E13;&#x8F66;&#x53F8;&#x673A;&#x3002;
 4&#xFF09;&#x5E26;&#x7236;&#x6BCD;&#x6E38;&#x73A9;&#x4E0B;&#x6C5F;&#x6D59;&#x6CAA;&#x3002;

 &#x6700;&#x540E;&#x5408;&#x7406;&#x5B89;&#x6392;&#x4E0B;&#x5F00;&#x8F66;&#x65F6;&#x95F4;&#xFF0C;&#x5C3D;&#x91CF;&#x5728;11&#x70B9;&#x534A;&#x524D;&#x56DE;&#x5BB6;&#xFF0C;11&#x70B9;&#x540E;&#x4E0D;&#x63A5;&#x5355;&#x4E86;&#xFF0C;&#x5076;&#x5C14;&#x51FA;&#x53BB;&#x5F00;&#x8F66;8&#x70B9;&#x534A;-11&#x70B9;&#x534A;&#x5F00;3&#x4E2A;&#x5C0F;&#x65F6;&#x8DB3;&#x77E3;&#x4E86;&#xFF0C;&#x4E0D;&#x8981;&#x8017;&#x8D39;&#x592A;&#x591A;&#x7CBE;&#x529B;&#x548C;&#x65F6;&#x95F4;&#x3002;&#x65F6;&#x95F4;&#x8FD8;&#x662F;&#x9700;&#x8981;&#x82B1;&#x5728;&#x63D0;&#x5347;&#x81EA;&#x5DF1;&#x7684;&#x6838;&#x5FC3;&#x4EF7;&#x503C;&#x4E0A;&#x3002;
&#x8BF4;&#x5230;&#x6838;&#x5FC3;&#x4EF7;&#x503C;&#xFF0C;&#x6765;&#x8BF4;&#x8BF4;&#x770B;&#x5427;&#xFF0C;&#x6700;&#x8FD1;&#x6280;&#x672F;&#x4E0A;&#x7684;&#x6709;&#x4E48;&#x6709;&#x8FDB;&#x6B65;?
&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;5&#x5E74;&#x5DE5;&#x4F5C;&#x7ECF;&#x9A8C;&#x7684;&#x5F00;&#x53D1;&#xFF0C;&#x6211;&#x7684;&#x6838;&#x5FC3;&#x7ADE;&#x4E89;&#x529B;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x4ECA;&#x5929;&#x597D;&#x597D;&#x95EE;&#x95EE;&#x81EA;&#x5DF1;&#xFF0C;&#x597D;&#x597D;&#x60F3;&#x60F3;&#xFF0C;&#x54EA;&#x4E9B;&#x65B9;&#x9762;&#x9700;&#x8981;&#x63D0;&#x9AD8;&#x3002;
&#x6838;&#x5FC3;&#x7ADE;&#x4E89;&#x529B;&#xFF1A;
    1&#xFF09;&#x9879;&#x76EE;&#x642D;&#x5EFA;&#x548C;&#x9879;&#x76EE;&#x8BBE;&#x8BA1;&#x7684;&#x7ECF;&#x9A8C;&#xFF0C;&#x7ECF;&#x5386;&#x8FC7;&#x5206;&#x5E93;&#x5206;&#x8868;&#xFF0C;&#x9879;&#x76EE;&#x91CD;&#x6784;&#x89E3;&#x8026;&#xFF0C;&#x642D;&#x5EFA;&#x9879;&#x76EE;&#x548C;&#x8BBE;&#x8BA1;&#x9879;&#x76EE;&#x7684;&#x7ECF;&#x9A8C;&#x6BD4;&#x4EE5;&#x524D;&#x591A;&#x4E86;&#x5F88;&#x591A;&#x3002;
    2&#xFF09;&#x9700;&#x6C42;&#x5206;&#x6790;&#x80FD;&#x529B;&#x548C;&#x4E1A;&#x52A1;&#x7406;&#x89E3;&#x80FD;&#x529B;&#x4E5F;&#x63D0;&#x9AD8;&#x4E86;&#x5F88;&#x591A;&#xFF0C;&#x80FD;&#x5FEB;&#x901F;&#x7406;&#x89E3;&#x4E1A;&#x52A1;&#x5E76;&#x6267;&#x884C;&#x5F00;&#x53D1;&#x8BA1;&#x5212;&#x3002;
    3&#xFF09;&#x5E76;&#x53D1;&#x7F16;&#x7A0B;&#x65B9;&#x9762;&#x7684;&#x7ECF;&#x9A8C;&#xFF0C;&#x5E42;&#x7B49;&#x63A7;&#x5236;&#xFF0C;&#x9AD8;&#x5E76;&#x53D1;&#x4E0B;&#x4E1A;&#x52A1;&#x7684;&#x5B89;&#x5168;&#x8FD0;&#x884C;&#x3002;
    4&#xFF09;&#x6545;&#x969C;&#x7684;&#x6392;&#x67E5;&#x548C;&#x5B9A;&#x4F4D;&#x80FD;&#x529B;&#x3002;
    5&#xFF09;&#x826F;&#x597D;&#x7684;&#x56E2;&#x961F;&#x6C9F;&#x901A;&#x548C;&#x8DE8;&#x56E2;&#x961F;&#x5408;&#x4F5C;&#x80FD;&#x529B;&#x3002;
    6&#xFF09;&#x5F3A;&#x70C8;&#x7684;&#x8D23;&#x4EFB;&#x611F;&#x3002;

&#x9700;&#x8981;&#x63D0;&#x9AD8;&#xFF1A;
    1&#xFF09;&#x9879;&#x76EE;&#x7ECF;&#x9A8C;&#x80FD;&#x591F;&#x7406;&#x8BBA;&#x5316;&#xFF0C;&#x9879;&#x76EE;&#x7ECF;&#x9A8C;&#x56DE;&#x5F52;&#x7406;&#x8BBA;&#x6280;&#x672F;&#xFF0C;&#x52A0;&#x6DF1;&#x5BF9;&#x6280;&#x672F;&#x7684;&#x7406;&#x89E3;&#xFF0C;&#x8B6C;&#x5982;&#xFF0C;&#x8FD9;&#x6B21;&#x91CD;&#x6784;&#x4F7F;&#x7528;&#x7684;&#x4E3B;&#x8981;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;--&#x62BD;&#x8C61;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#xFF0C;&#x4F46;&#x662F;&#x4EC0;&#x4E48;&#x662F;&#x62BD;&#x8C61;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#xFF0C;&#x597D;&#x597D;&#x56DE;&#x5F52;&#x4E0B;&#x3002;
    2&#xFF09;&#x91CD;&#x70B9;&#x6DF1;&#x8015;&#x67D0;&#x4E2A;&#x9886;&#x57DF;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x6BD4;&#x5982;&#x5E76;&#x53D1;&#x7F16;&#x7A0B;&#xFF0C;&#x8B6C;&#x5982;&#x7F13;&#x5B58;&#x7684;&#x4F7F;&#x7528;&#xFF0C;&#x8B6C;&#x5982;&#x7F51;&#x7EDC;&#x7F16;&#x7A0B;&#x3002;
    3&#xFF09;&#x57F9;&#x517B;&#x5E26;&#x9886;&#x65B0;&#x4EBA;&#x548C;&#x56E2;&#x5355;&#x7BA1;&#x7406;&#x7684;&#x80FD;&#x529B;
</code></pre>
        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">


</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2016/03/15/美团点评case对应技术负责团队/" title="美团点评case对应技术负责团队" itemprop="url">美团点评case对应技术负责团队</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="EdwardGuo" target="_blank" itemprop="author">EdwardGuo</a>
		
  <p class="article-time">
    <time datetime="2016-03-15T03:04:02.000Z" itemprop="datePublished"> 發表於 2016-03-15</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p>&#x5BA2;&#x670D;&#x5C0F;&#x4F19;&#x4F34;&#x6BCF;&#x5929;&#x9762;&#x5BF9;&#x6210;&#x767E;&#x4E0A;&#x5343;&#x7684;case&#xFF0C;&#x7ECF;&#x5E38;&#x627E;&#x4E0D;&#x5230;&#x5BF9;&#x5E94;&#x7684;&#x8D1F;&#x8D23;&#x4EBA;&#xFF0C;&#x4EE5;&#x4E0B;&#x6574;&#x7406;&#x4E86;&#x4E0B;&#x5404;&#x4E2A;&#x4E1A;&#x52A1;&#x5BF9;&#x5E94;&#x7684;&#x8D1F;&#x8D23;&#x56E2;&#x961F;&#x548C;&#x8D1F;&#x8D23;&#x4EBA;&#xFF0C;&#x5E0C;&#x671B;&#x5BA2;&#x670D;&#x5C0F;&#x4F19;&#x4ECE;case&#x4E2D;&#x63D0;&#x53D6;&#x6709;&#x6548;&#x4FE1;&#x606F;&#xFF0C;&#x627E;&#x5230;&#x76F8;&#x5E94;&#x56E2;&#x961F;&#xFF0C;&#x8BE5;&#x4FE1;&#x606F;&#x4F1A;&#x6301;&#x7EED;&#x66F4;&#x65B0;&#x3002;</p>
<p>1&#xFF0C;&#x5546;&#x5BB6;&#x9A8C;&#x5238;&#x95EE;&#x9898;&#xFF0C;&#x5982;&#x9A8C;&#x4E0D;&#x4E86;&#x5238;&#xFF0C;&#x8BF7;&#x5546;&#x5BB6;&#x63D0;&#x4F9B;&#x4E0B;&#x9A8C;&#x5238;&#x5931;&#x8D25;&#x7684;&#x8FD4;&#x56DE;&#x4FE1;&#x606F;&#xFF0C;&#x9A8C;&#x8BC1;&#x95E8;&#x5E97;&#x975E;&#x6CD5;&#x7B49;&#x95EE;&#x9898;&#x8BF7;&#x8054;&#x7CFB;&#x2013;&#x5238;&#x670D;&#x52A1;&#x7814;&#x53D1; <a href="/mailto:apollo.receipt@dianping.com">apollo.receipt@dianping.com</a>&#xFF0C;&#x7D27;&#x6025;&#x8054;&#x7CFB;&#x4EBA;&#x90ED;&#x5229;&#x5175;&#xFF0C;&#x5A04;&#x9AD8;&#x660E;&#x3002;<br>2&#xFF0C;&#x7528;&#x6237;&#x53D1;&#x5238;&#x95EE;&#x9898;&#xFF0C;&#x6D88;&#x8D39;&#x8005;&#x8D2D;&#x4E70;&#x56E2;&#x8D2D;&#x5238;&#xFF0C;&#x652F;&#x4ED8;&#x6210;&#x529F;&#x540E;&#x4E0D;&#x80FD;&#x53D1;&#x5238;&#xFF0C;&#x8BF7;&#x8054;&#x7CFB;&#x2013;&#x5238;&#x670D;&#x52A1;&#x7814;&#x53D1; <a href="/mailto:apollo.receipt@dianping.com">apollo.receipt@dianping.com</a>&#xFF0C;&#x7D27;&#x6025;&#x8054;&#x7CFB;&#x4EBA;&#x90ED;&#x5229;&#x5175;&#xFF0C;&#x5A04;&#x9AD8;&#x660E;&#x3002;<br>3&#xFF0C;&#x56E2;&#x8D2D;&#x9000;&#x6B3E;&#x95EE;&#x9898;&#xFF0C;&#x5982;&#x53D1;&#x5238;&#x9000;&#x6B3E;&#x540E;&#x4E00;&#x76F4;&#x5904;&#x4E8E;&#x5BA1;&#x6838;&#x4E2D;&#xFF0C;&#x9000;&#x6B3E;&#x5F02;&#x5E38;&#x7B49;&#x95EE;&#x9898;&#xFF0C;&#x8BF7;&#x8054;&#x7CFB;&#x2013;&#x652F;&#x4ED8;&#x5F00;&#x53D1;&#x6D4B;&#x8BD5;&#x90AE;&#x4EF6;&#x7EC4; <a href="/mailto:paycenter-rd-qa@dianping.com">paycenter-rd-qa@dianping.com</a>&#xFF0C;&#x7D27;&#x6025;&#x8054;&#x7CFB;&#x4EBA;&#x674E;&#x534E;&#x6170;&#x3002;<br>4&#xFF0C;&#x95EA;&#x60E0;&#x652F;&#x4ED8;&#x95EE;&#x9898;&#xFF0C;&#x5982;&#x95EA;&#x60E0;&#x4E70;&#x5355;&#x5931;&#x8D25;&#xFF0C;&#x95EA;&#x60E0;&#x4E70;&#x5355;&#x540E;&#x5546;&#x6237;&#x770B;&#x4E0D;&#x5230;&#x4E70;&#x5355;&#x8BB0;&#x5F55;&#xFF0C;&#x8BF7;&#x8054;&#x7CFB;&#x2013;hui-dev@dianping.com&#xFF0C;&#x7D27;&#x6025;&#x8054;&#x7CFB;&#x4EBA;&#xFF0C;&#x590F;&#x4E4B;&#x51AC;&#x3002;<br>5&#xFF0C;&#x5546;&#x5BB6;&#x7ED3;&#x7B97;&#x95EE;&#x9898;&#xFF0C;&#x5982;&#x7ED9;&#x5546;&#x5BB6;&#x7ED3;&#x7B97;&#x6570;&#x989D;&#x4E0D;&#x5BF9;&#xFF0C;&#x8BF7;&#x8054;&#x7CFB;&#x2013;&#x5546;&#x5BB6;&#x7ED3;&#x7B97;&#x7814;&#x53D1; <a href="/mailto:settle@dianping.com">settle@dianping.com</a>&#xFF0C;&#x7D27;&#x6025;&#x8054;&#x7CFB;&#x4EBA;&#x5F90;&#x6D69;&#x4EAE;&#x3002;<br>6&#xFF0C;&#x56E2;&#x5355;&#x642C;&#x5355;&#x95EE;&#x9898;&#xFF0C;&#x5982;&#x56E2;&#x5355;&#x5F02;&#x5E38;&#x4E0B;&#x7EBF;&#xFF0C;&#x56E2;&#x5355;&#x672A;&#x80FD;&#x53CC;C&#x540C;&#x6B65;&#xFF0C;&#x627E;&#x4E0D;&#x5230;&#x56E2;&#x5355;&#x7B49;&#x95EE;&#x9898;&#xFF0C;&#x8BF7;&#x8054;&#x7CFB;&#x2013;&#x4EA4;&#x6613;&#x5E73;&#x53F0;.&#x4EA7;&#x54C1;&#x4E2D;&#x5FC3; <a href="/mailto:bs.ba@dianping.com">bs.ba@dianping.com</a>&#xFF0C;&#x7D27;&#x6025;&#x8054;&#x7CFB;&#x4EBA;&#x9AD8;&#x751C;&#x751C;&#x3002;<br>7&#xFF0C;&#x56E2;&#x5355;&#x9500;&#x91CF;&#x5C55;&#x793A;&#xFF0C;&#x5982;&#x56E2;&#x5355;&#x9500;&#x91CF;&#x5C55;&#x793A;&#x6570;&#x636E;&#x4E0D;&#x51C6;&#x786E;&#xFF0C;&#x8BF7;&#x8054;&#x7CFB;&#x2013;&#x4EA4;&#x6613;&#x5E73;&#x53F0;&#x4E3B;&#x9891;&#x9053;&#x6280;&#x672F;&#x56E2;&#x961F; <a href="/mailto:tp-main@dianping.com">tp-main@dianping.com</a>&#xFF0C;&#x7D27;&#x6025;&#x8054;&#x7CFB;&#x4EBA;&#xFF0C;&#x848B;&#x661F;&#xFF0C;&#x9A6C;&#x660E;&#x5174;&#x3002;<br>8&#xFF0C;&#x5546;&#x5BB6;&#x81EA;&#x4FC3;&#x95EE;&#x9898;&#xFF0C;&#x5982;&#x81EA;&#x4FC3;&#x7A81;&#x7136;&#x6D88;&#x5931;&#xFF0C;&#x8BF7;&#x8054;&#x7CFB;&#x2013;&#x5546;&#x5BB6;&#x670D;&#x52A1;&#x7814;&#x53D1;&#x7EC4; <a href="/mailto:general-so-market-tech@dianping.com">general-so-market-tech@dianping.com</a>&#xFF0C;&#x7D27;&#x6025;&#x8054;&#x7CFB;&#x4EBA;&#x6C88;&#x4F69;&#x742A;&#xFF0C;&#x8D75;&#x5B87;&#x7136;&#x3002;<br>9&#xFF0C;App&#x76F8;&#x5173;&#x95EE;&#x9898;&#xFF0C;&#x5982;IOS&#xFF0C;&#x5B89;&#x5353;&#x70B9;&#x8BC4;&#x7BA1;&#x5BB6;&#x767B;&#x9646;&#x4E0D;&#x4E86;&#xFF0C;&#x6216;&#x8005;&#x767B;&#x9646;&#x540E;&#x65E0;&#x6CD5;&#x9009;&#x62E9;&#x9A8C;&#x8BC1;&#x95E8;&#x5E97;&#xFF0C;&#x8BF7;&#x8054;&#x7CFB;&#x2013;&#x4EA4;&#x6613;&#x540E;&#x53F0;&#x5BA2;&#x6237;&#x7AEF; <a href="/mailto:dianpingBC@dianping.com">dianpingBC@dianping.com</a>&#xFF0C;&#x7D27;&#x6025;&#x8054;&#x7CFB;&#x4EBA;&#x5B63;&#x6D69;&#x52C9;&#x3002;<br>10&#xFF0C;&#x7B2C;&#x4E09;&#x65B9;&#x5BF9;&#x63A5;&#x95EE;&#x9898;&#xFF0C;&#x5982;&#x5546;&#x6237;&#x60F3;&#x7533;&#x8BF7;&#x548C;&#x70B9;&#x8BC4;&#x5BF9;&#x63A5;&#xFF0C;&#x8BF7;&#x8054;&#x7CFB;&#x2013;&#x5434;&#x6587;&#x6770;&#xFF0C;&#x5B8B;&#x8861;&#x3002;</p>
<p>2009130269</p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">


</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2016/03/13/HttpClient踩坑有感/" title="HttpClient踩坑有感" itemprop="url">HttpClient踩坑有感</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="EdwardGuo" target="_blank" itemprop="author">EdwardGuo</a>
		
  <p class="article-time">
    <time datetime="2016-03-13T14:35:33.000Z" itemprop="datePublished"> 發表於 2016-03-13</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p>&#x672C;&#x5468;&#x5728;HttpClient&#x4E0A;&#x72AF;&#x4E86;&#x4E2A;&#x4F4E;&#x7EA7;&#x9519;&#x8BEF;&#xFF0C;&#x672A;&#x7ED9;HttpClient&#x8BBE;&#x7F6E;&#x6700;&#x5927;&#x8FDE;&#x63A5;&#x6570;(HttpClient&#x9ED8;&#x8BA4;&#x5355;&#x8DEF;&#x7531;&#x6700;&#x5927;Http&#x8FDE;&#x63A5;&#x6570;&#x4E3A;2)&#xFF0C;&#x5BFC;&#x81F4;&#x5E76;&#x53D1;&#x91CF;&#x9AD8;&#x65F6;Http&#x8BF7;&#x6C42;&#x5927;&#x91CF;&#x5904;&#x4E8E;&#x7B49;&#x5F85;&#x72B6;&#x6001;&#xFF0C;&#x501F;&#x6B64;&#x673A;&#x4F1A;&#xFF0C;&#x6B63;&#x597D;&#x5BF9;&#x6BD4;&#x4E86;&#x4E0B;HttpClient&#x548C;HttpURLConnection&#xFF0C;&#x4EE5;&#x6B64;&#x94ED;&#x8BB0;&#x3002;</p>
<p>HttpClient &#x6267;&#x884C;&#x4E00;&#x6B21;Http Get&#x8BF7;&#x6C42;&#x4E3B;&#x8981;&#x7ECF;&#x8FC7;&#x4EE5;&#x4E0B;&#x6B65;&#x9AA4;&#xFF1A;<br>    1&#xFF0C;&#x79DF;&#x4E00;&#x4E2A; Http&#x94FE;&#x63A5;&#xFF0C;&#x6E90;&#x7801;&#x4E2D;&#x7528;&#x4E86;lease&#x8FD9;&#x4E2A;&#x5173;&#x952E;&#x5B57;&#xFF0C;&#x4E2A;&#x4EBA;&#x89C9;&#x5F97;lease&#x8FD9;&#x662F;&#x548C;HttpURLConnection&#x6700;&#x5927;&#x7684;&#x533A;&#x522B;&#xFF0C;&#x79DF;&#x8868;&#x793A;&#x7528;&#x5B8C;&#x5C31;&#x8FD8;&#x56DE;&#x53BB;&#xFF0C;&#x800C;HttpURLConnection&#x4F7F;&#x7528;&#x5B8C;&#x6BD5;&#x540E;&#x5C31;close&#x3002;<br>    2&#xFF0C;&#x5224;&#x65AD;&#x5F53;&#x524D;&#x662F;&#x5426;&#x5DF2;&#x7ECF;&#x548C;&#x76EE;&#x6807;&#x4E3B;&#x673A;&#x4E4B;&#x95F4;&#x8FDE;&#x63A5;&#x662F;&#x5426;&#x5DF2;&#x7ECF;&#x6253;&#x5F00;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#xFF0C;&#x5219;&#x6253;&#x5F00;socket&#x8FDE;&#x63A5;&#x3002;<br>    3&#xFF0C;TCP&#x8FDE;&#x63A5;&#x5EFA;&#x7ACB;&#xFF0C;&#x4FBF;&#x5411;&#x76EE;&#x6807;&#x4E3B;&#x673A;&#x53D1;&#x9001;Http&#x8BF7;&#x6C42;&#xFF0C;&#x5F85;&#x76EE;&#x6807;&#x4E3B;&#x673A;&#x5904;&#x7406;&#x8BF7;&#x6C42;&#x540E;&#x8FD4;&#x56DE;Http&#x7ED3;&#x679C;&#x3002;<br>    4&#xFF0C;&#x8BF7;&#x6C42;&#x5904;&#x7406;&#x5B8C;&#x6BD5;&#x4E4B;&#x540E;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x5C31;&#x662F;&#x4E0E;HttpURLConnection&#x533A;&#x522B;&#x6700;&#x5927;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x9700;&#x8981;&#x5224;&#x65AD;&#x662F;&#x5426;&#x8981;&#x56DE;&#x6536;&#x8BE5;Http&#x8FDE;&#x63A5;&#x91CD;&#x65B0;&#x653E;&#x56DE;&#x8FDE;&#x63A5;&#x6C60;&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x5BF9;&#x8FD4;&#x56DE;&#x7684;HttpResponse&#x8FDB;&#x884C;&#x5224;&#x65AD;&#x3002;<br>        4.1&#xFF0C;&#x5148;&#x68C0;&#x67E5;Http&#x5934;&#x90E8;&#x6587;&#x4EF6;&#x91CC;&#x7684;Connection&#x5C5E;&#x6027;&#xFF0C;&#x5982;&#x679C;&#x4E3A;close&#x8868;&#x793A;&#x8FDE;&#x63A5;&#x5DF2;&#x5173;&#x95ED;&#xFF0C;&#x4E0D;&#x80FD;&#x56DE;&#x6536;&#x3002;<br>        4.2&#xFF0C;&#x5982;&#x679C;Http&#x5934;&#x90E8;&#x6587;&#x4EF6;&#x91CC;&#x7684;Connection&#x5C5E;&#x6027;&#x4E3A;:keep-alive&#xFF0C;&#x8868;&#x793A;&#x4E3A;&#x6301;&#x4E45;&#x7EC3;&#x7EA7;&#xFF0C;&#x53EF;&#x4EE5;&#x56DE;&#x6536;&#xFF0C;http 1.1 &#x4EE5;&#x540E;&#x9ED8;&#x8BA4;&#x90FD;&#x662F;&#x6301;&#x4E45;&#x8FDE;&#x63A5;,http 1.0 &#x4EE5;&#x524D;&#x4E3A;&#x77ED;&#x8FDE;&#x63A5;&#x3002;<br>    5&#xFF0C;&#x5982;&#x679C;&#x8BF7;&#x6C42;&#x80FD;&#x88AB;&#x56DE;&#x6536;&#xFF0C;&#x518D;&#x7ECF;&#x8FC7;&#x6821;&#x9A8C;(&#x5982;&#xFF0C;&#x662F;&#x5426;&#x5DF2;&#x8D85;&#x65F6;)&#xFF0C;&#x91CD;&#x65B0;&#x653E;&#x56DE;&#x8FDE;&#x63A5;&#x6C60;&#x3002;</p>
<p>&#x4EE5;&#x4E0A;&#x4FBF;&#x662F;HttpClient&#x7684;&#x6267;&#x884C;&#x4E00;&#x4E2A;Http&#x8BF7;&#x6C42;&#x7684;&#x7ECF;&#x8FC7;&#xFF0C;&#x800C;&#x5BF9;&#x4E8E;Java&#x81EA;&#x5E26;&#x7684;Http&#x5B9E;&#x73B0;&#x7C7B;HttpURLConnection,&#x6267;&#x884C;&#x4E00;&#x4E2A;Http&#x8BF7;&#x6C42;&#x5982;&#x4E0B;&#xFF1A;<br>    1&#xFF0C;&#x6253;&#x5F00;&#x4E00;&#x4E2A;Http&#x8FDE;&#x63A5;&#x3002;<br>    2&#xFF0C;&#x8BBE;&#x7F6E;&#x8D85;&#x65F6;&#x65F6;&#x95F4;&#x548C;&#x8BF7;&#x6C42;&#x65B9;&#x5F0F;&#xFF0C;Get &#x6216;&#x8005;POST&#x3002;<br>    3&#xFF0C;&#x5EFA;&#x7ACB;TCP&#x8FDE;&#x63A5;&#xFF0C;&#x5411;&#x76EE;&#x6807;&#x4E3B;&#x673A;&#x53D1;&#x9001;Http&#x8BF7;&#x6C42;&#x3002;<br>    4&#xFF0C;&#x63A5;&#x6536;&#x8BF7;&#x6C42;&#x8FD4;&#x56DE;&#x7ED3;&#x679C;&#xFF0C;&#x5173;&#x95ED;&#x8FDE;&#x63A5;&#x3002;</p>
<pre><code>&#x6CA1;&#x6709;&#x5BF9;&#x4E24;&#x8005;&#x5177;&#x4F53;&#x6E90;&#x7801;&#x5B9E;&#x73B0;&#x539F;&#x7406;&#x505A;&#x6DF1;&#x523B;&#x5BF9;&#x6BD4;&#xFF0C;HttpClient&#x7684;&#x6E90;&#x7801;&#x5B9E;&#x73B0;&#x6BD4;&#x8F83;&#x590D;&#x6742;&#xFF0C;&#x5C31;&#x4E0D;&#x9610;&#x8FF0;&#x4E86;&#xFF0C;&#x4ECE;&#x5B9E;&#x73B0;&#x6765;&#x770B;&#xFF0C;HttpClient&#x548C;HttpURLConnection&#x6700;&#x5927;&#x7684;&#x533A;&#x522B;&#x5728;&#x4E8E;&#x4E00;&#x4E2A;&#x662F;&#x79DF;&#x4E86;&#x4E00;&#x4E2A;&#x8FDE;&#x63A5;&#xFF0C;&#x7528;&#x4E86;&#x4E4B;&#x540E;&#x518D;&#x653E;&#x56DE;&#x8FDE;&#x63A5;&#x6C60;&#xFF0C;&#x800C;&#x53E6;&#x4E00;&#x4E2A;&#x5219;&#x662F;&#x65B0;&#x5EFA;&#x4E00;&#x4E2A;&#x8FDE;&#x63A5;&#x3002;HttpClient&#x7EF4;&#x62A4;&#x4E86;&#x4E00;&#x4E2A;&#x8FDE;&#x63A5;&#x6C60;&#xFF0C;&#x4E0D;&#x5FC5;&#x6BCF;&#x6B21;&#x90FD;&#x65B0;&#x5EFA;&#xFF0C;&#x4ECE;&#x800C;&#x4F7F;&#x5F97;&#x5728;&#x540C;&#x6837;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x80FD;&#x5904;&#x7406;&#x66F4;&#x5927;&#x541E;&#x5410;&#x91CF;&#x7684;Http&#x8BF7;&#x6C42;&#x3002;HttpURLConnection&#x662F;Jdk&#x81EA;&#x5E26;&#x7684;Http&#x5B9E;&#x73B0;&#xFF0C;&#x4F18;&#x70B9;&#x662F;&#x7B80;&#x5355;&#x6613;&#x7528;&#x3002;&#x6027;&#x80FD;&#x65B9;&#x9762;&#xFF0C;&#x4E2A;&#x4EBA;&#x89C9;&#x5F97;HttpURLConnection&#x5728;&#x5E76;&#x53D1;&#x91CF;&#x5C0F;&#x7684;&#x60C5;&#x51B5;&#x4F1A;&#x6709;&#x4F18;&#x52BF;&#xFF0C;
HttpClient&#x6709;&#x5F88;&#x591A;&#x8BF7;&#x6C42;&#x6821;&#x9A8C;&#xFF0C;&#x4EE5;&#x53CA;&#x8BF7;&#x6C42;&#x62A5;&#x6587;&#xFF0C;&#x62A5;&#x6587;&#x5934;&#xFF0C;&#x7EBF;&#x7A0B;&#x6C60;&#x7BA1;&#x7406;&#x7B49;&#x590D;&#x6742;&#x5BF9;&#x8C61;&#x521D;&#x59CB;&#x5316;&#x8FC7;&#x7A0B;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x9AD8;&#x5E76;&#x53D1;&#x60C5;&#x51B5;&#xFF0C;HttpClient&#x66F4;&#x6709;&#x4F18;&#x52BF;&#x3002;

&#x6240;&#x4EE5;&#x5728;Http&#x5E76;&#x53D1;&#x91CF;&#x8F83;&#x5927;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F18;&#x5148;&#x9009;&#x62E9;HttpClient&#xFF0C;&#x5F53;&#x7136;&#x4F7F;&#x7528;HttpClient&#x8981;&#x5148;&#x7406;&#x89E3;&#x6E05;&#x695A;Http&#x914D;&#x7F6E;&#x53C2;&#x6570;&#x7684;&#x542B;&#x4E49;&#xFF0C;&#x5982;&#x6700;&#x5927;&#x8FDE;&#x63A5;&#x6570;&#xFF0C;&#x5355;&#x8DEF;&#x7531;&#x6700;&#x5927;&#x8FDE;&#x63A5;&#x6570;&#xFF0C;&#x8BF7;&#x6C42;&#x8FDE;&#x63A5;&#x8D85;&#x65F6;&#x65F6;&#x95F4;&#xFF0C;Socket&#x8D85;&#x65F6;&#x65F6;&#x95F4;&#x7B49;&#x7B49;&#xFF0C;&#x5426;&#x5219;&#x4F1A;&#x5E26;&#x6765;&#x6F5C;&#x5728;&#x7684;&#x98CE;&#x9669;&#x3002;
&#x5F53;&#x7136;&#x5982;&#x679C;Http&#x5E76;&#x53D1;&#x91CF;&#x4E0D;&#x5927;&#x7684;&#x60C5;&#x51B5;&#xFF0C;HttpURLConnection&#x4E5F;&#x662F;&#x4E0D;&#x9519;&#x7684;&#x9009;&#x62E9;&#xFF0C;&#x7B80;&#x5355;&#x660E;&#x4E86;&#x4E0D;&#x6613;&#x51FA;&#x9519;&#x3002;
</code></pre>
        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">


</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2016/02/13/规规矩矩做狗/" title="规规矩矩做狗" itemprop="url">规规矩矩做狗</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="EdwardGuo" target="_blank" itemprop="author">EdwardGuo</a>
		
  <p class="article-time">
    <time datetime="2016-02-13T08:46:30.000Z" itemprop="datePublished"> 發表於 2016-02-13</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p>&#x56DE;&#x6765;&#x7684;&#x8DEF;&#x4E0A;&#x770B;&#x5230;&#x4E00;&#x53EA;&#x5FAE;&#x7B11;&#x5929;&#x4F7F;&#x2013;&#x8428;&#x6469;&#x8036;&#x4E0D;&#x542C;&#x4E3B;&#x4EBA;&#x8BDD;&#x5230;&#x5904;&#x4E71;&#x55C5;&#x4E71;&#x8DD1;&#x88AB;&#x4E3B;&#x4EBA;&#x8BAD;&#x65A5;&#xFF0C;&#x4FBF;&#x60F3;&#x8D77;&#x5F53;&#x521D;&#x81EA;&#x5DF1;&#x5BF9;Blue&#x4E5F;&#x5E38;&#x5E38;&#x53D1;&#x813E;&#x6C14;&#xFF0C;&#x4E5F;&#x56E0;&#x4E3A;&#x4ED6;&#x4E0D;&#x542C;&#x8BDD;&#xFF0C;&#x5230;&#x5904;&#x4E71;&#x55C5;&#xFF0C;&#x89C1;&#x5230;&#x72D7;&#x5C31;&#x6FC0;&#x52A8;&#x4E0D;&#x5DF2;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x6BCD;&#x72D7;&#x3002;&#x4E2D;&#x56FD;&#x4EBA;&#x8D8A;&#x6765;&#x8D8A;&#x63A5;&#x6536;&#x5BA0;&#x7269;&#x7279;&#x522B;&#x662F;&#x72D7;&#x548C;&#x732B;&#xFF0C;&#x8FD9;&#x662F;&#x4E2A;&#x597D;&#x73B0;&#x8C61;&#xFF0C;&#x8BF4;&#x660E;&#x5927;&#x90E8;&#x5206;&#x56FD;&#x4EBA;&#x90FD;&#x662F;&#x5BCC;&#x6709;&#x7231;&#x5FC3;&#xFF0C;&#x540C;&#x65F6;&#x5BA2;&#x89C2;&#x7684;&#x8BB2;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x4E2D;&#x56FD;&#x7684;&#x5BA0;&#x7269;&#x7531;&#x4E8E;&#x7F3A;&#x4E4F;&#x5408;&#x9002;&#x7684;&#x57F9;&#x8BAD;&#xFF08;&#x77EB;&#x60C5;&#x70B9;&#x8BF4;&#x662F;&#x6559;&#x80B2;&#xFF09;&#xFF0C;&#x5BFC;&#x81F4;&#x4E86;&#x4E3B;&#x4EBA;&#x4F1A;&#x89C9;&#x5F97;&#x529B;&#x4E0D;&#x4ECE;&#x5FC3;&#xFF0C;&#x4EE5;&#x4E0B;&#x603B;&#x7ED3;&#x4E0B;&#x4E2D;&#x56FD;&#x5BA0;&#x7269;&#x72D7;&#x7684;&#x4E0D;&#x826F;&#x4E60;&#x60EF;&#xFF08;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x72D7;&#x7238;&#xFF0C;&#x7EDD;&#x5BF9;&#x6CA1;&#x6709;&#x534A;&#x70B9;&#x8BBD;&#x523A;&#x5BA0;&#x7269;&#x72D7;&#xFF09;<br>    1.&#x5230;&#x5904;&#x4E71;&#x55C5;&#xFF1A;&#x8FD9;&#x53EF;&#x80FD;&#x6700;&#x5E38;&#x89C1;&#x5E76;&#x4E14;&#x6700;&#x4EE4;&#x72D7;&#x72D7;&#x70E6;&#x607C;&#x7684;&#x4E00;&#x4E2A;&#x4E0D;&#x826F;&#x4E60;&#x60EF;&#xFF0C;&#x867D;&#x8BF4;&#x662F;&#x72D7;&#x7684;&#x672C;&#x6027;&#xFF0C;&#x53D1;&#x73B0;&#x540C;&#x7C7B;&#x7684;&#x5473;&#x9053;&#x4F1A;&#x53BB;&#x95FB;&#x4E00;&#x4E0B;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x905B;&#x72D7;&#x7684;&#x65F6;&#x5019;&#x5018;&#x82E5;&#x72D7;&#x72D7;&#x80FD;&#x62AC;&#x5934;&#x5F80;&#x524D;&#x8D70;&#x90A3;&#x591A;&#x4E48;&#x6109;&#x5FEB;&#x3002;<br>    2.&#x968F;&#x5730;&#x5927;&#x5C0F;&#x4FBF;&#xFF1A;&#x867D;&#x7136;&#x5927;&#x90E8;&#x5206;&#x4E3B;&#x4EBA;&#x4F1A;&#x81EA;&#x5E26;&#x5851;&#x6599;&#x888B;&#x6536;&#x62FE;&#x72D7;&#x72D7;&#x7684;&#x6392;&#x4FBF;&#xFF0C;&#x4F46;&#x662F;&#x6BD5;&#x7ADF;&#x4E0D;&#x80FD;&#x5B8C;&#x5168;&#x6E05;&#x9664;&#x72D7;&#x72D7;&#x7684;&#x6392;&#x4FBF;&#xFF0C;&#x7279;&#x522B;&#x72D7;&#x72D7;&#x968F;&#x5904;&#x4E71;&#x6492;&#x5C3F;&#xFF0C;&#x7ED9;&#x8DEF;&#x4EBA;&#x4F1A;&#x5E26;&#x6765;&#x4E0D;&#x5FEB;&#xFF0C;&#x4E5F;&#x7ED9;&#x73AF;&#x5883;&#x5E26;&#x6765;&#x4E0D;&#x826F;&#x5F71;&#x54CD;&#x3002;<br>    3.&#x89C1;&#x5230;&#x72D7;&#x4FBF;&#x6FC0;&#x52A8;&#xFF1A;&#x7EDD;&#x5927;&#x90E8;&#x5206;&#x72D7;&#x89C1;&#x5230;&#x540C;&#x7C7B;&#x4E0D;&#x662F;&#x6FC0;&#x52A8;&#x7684;&#x4E71;&#x8DF3;&#x5C31;&#x662F;&#x9738;&#x9053;&#x7684;&#x4E71;&#x53EB;&#xFF0C;&#x905B;&#x72D7;&#x65F6;&#x8BA9;&#x5927;&#x90E8;&#x5206;&#x4E3B;&#x4EBA;&#x611F;&#x5230;&#x5FC3;&#x7D2F;&#xFF0C;&#x5018;&#x82E5;&#x72D7;&#x89C1;&#x5230;&#x540C;&#x7C7B;&#x80FD;&#x5B89;&#x9759;&#x7684;&#x4E0A;&#x6B21;&#x6253;&#x4E2A;&#x62DB;&#x547C;&#x90A3;&#x591A;&#x7F8E;&#x3002;<br>    4.&#x6251;&#x4EBA;&#xFF1A;&#x5F53;&#x9047;&#x5230;&#x70ED;&#x60C5;&#x7684;&#x7231;&#x72D7;&#x4EBA;&#x58EB;&#x65F6;&#xFF0C;&#x4F1A;&#x6FC0;&#x52A8;&#x6251;&#x4E0A;&#x53BB;&#xFF0C;&#x4E9B;&#x8BB8;&#x65F6;&#x5019;&#x4F1A;&#x5413;&#x5230;&#x522B;&#x4EBA;&#xFF0C;&#x5018;&#x82E5;&#x9047;&#x5230;&#x70ED;&#x60C5;&#x7684;&#x7231;&#x72D7;&#x4EBA;&#x58EB;&#x80FD;&#x6DE1;&#x5B9A;&#x8214;&#x8214;&#x5BF9;&#x65B9;&#x7684;&#x624B;&#x90A3;&#x8BE5;&#x591A;&#x597D;&#x3002;<br>    5.&#x6311;&#x98DF;&#xFF1A;&#x5927;&#x90E8;&#x5206;&#x72D7;&#x5403;&#x4E86;&#x597D;&#x7684;&#x4E1C;&#x897F;&#x4FBF;&#x4E0D;&#x7231;&#x5403;&#x72D7;&#x7CAE;&#xFF0C;&#x4E3B;&#x4EBA;&#x997F;&#x7740;&#x53C8;&#x5FC3;&#x75BC;&#xFF0C;&#x7ED9;&#x5403;&#x8089;&#x53C8;&#x8D35;&#x5BF9;&#x72D7;&#x672C;&#x8EAB;&#x53C8;&#x4E0D;&#x597D;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x4E00;&#x5927;&#x75DB;&#x70B9;&#x3002;<br>    6.&#x6253;&#x67B6;&#xFF1A;&#x6253;&#x67B6;&#x4E5F;&#x662F;&#x5F88;&#x591A;&#x5927;&#x72D7;&#x7684;&#x6076;&#x4E60;&#xFF0C;&#x91D1;&#x6BDB;&#xFF0C;&#x62C9;&#x5E03;&#x62C9;&#x591A;&#xFF0C;&#x8428;&#x6469;&#x5C24;&#x4E3A;&#x5E38;&#x89C1;&#xFF0C;&#x5927;&#x72D7;&#x5E38;&#x5E38;&#x4E3A;&#x4E86;&#x4E89;&#x62A2;&#x5E95;&#x76D8;&#x6216;&#x535A;&#x53D6;&#x6BCD;&#x72D7;&#x7684;&#x6B22;&#x5FC3;&#x800C;&#x6253;&#x67B6;&#xFF0C;&#x867D;&#x8BF4;&#x662F;&#x52A8;&#x7269;&#x7684;&#x672C;&#x80FD;&#xFF0C;&#x4F46;&#x6BD5;&#x7ADF;&#x662F;&#x5BA0;&#x7269;&#x72D7;&#xFF0C;&#x4E0D;&#x80FD;&#x6309;&#x7167;&#x672C;&#x80FD;&#x53BB;&#x8981;&#x6C42;&#x3002;</p>
<p>&#x4EE5;&#x4E0A;&#x662F;&#x56FD;&#x5185;&#x5BA0;&#x7269;&#x72D7;&#x7684;&#x4E0D;&#x826F;&#x4E60;&#x60EF;&#xFF0C;&#x5F53;&#x7136;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x5F88;&#x89C4;&#x77E9;&#x7684;&#x72D7;&#x72D7;&#xFF0C;&#x5982;&#x679C;&#x72D7;&#x72D7;&#x90FD;&#x80FD;&#x89C4;&#x89C4;&#x77E9;&#x77E9;&#xFF0C;&#x90A3;&#x4F1A;&#x7ED9;&#x57CE;&#x5E02;&#x751F;&#x6D3B;&#x5E26;&#x6765;&#x66F4;&#x591A;&#x4E50;&#x8DA3;&#xFF0C;&#x4E5F;&#x7ED9;&#x4E3B;&#x4EBA;&#x51CF;&#x5C11;&#x5F88;&#x591A;&#x70E6;&#x607C;&#xFF0C;&#x4E00;&#x6761;&#x7406;&#x60F3;&#x7684;&#x89C4;&#x77E9;&#x7684;&#x72D7;&#x5E94;&#x8BE5;&#x662F;&#xFF1A;<br>    1.&#x6027;&#x683C;&#x6E29;&#x987A;&#xFF0C;&#x4E0D;&#x9738;&#x9053;&#xFF0C;&#x4E0E;&#x72D7;&#x4E3A;&#x5584;&#x3002;<br>    2.&#x4E0D;&#x5BB9;&#x6613;&#x6FC0;&#x52A8;&#xFF0C;&#x4E0D;&#x7BA1;&#x89C1;&#x5230;&#x4EBA;&#x8FD8;&#x662F;&#x72D7;&#x3002;<br>    3.&#x62AC;&#x5934;&#x8D70;&#x8DEF;&#xFF0C;&#x62B5;&#x6297;&#x4F4F;&#x540C;&#x7C7B;&#x5473;&#x9053;&#x7684;&#x8BF1;&#x60D1;&#x4E0D;&#x5230;&#x5904;&#x4E71;&#x55C5;&#x3002;<br>    4.&#x4E0D;&#x968F;&#x5730;&#x5927;&#x5C0F;&#x4FBF;&#xFF0C;&#x80FD;&#x514B;&#x5236;&#xFF0C;&#x517B;&#x6210;&#x89C4;&#x5F8B;&#x7684;&#x6392;&#x4FBF;&#x4E60;&#x60EF;&#x3002;<br>    5.&#x4E0D;&#x6311;&#x98DF;&#xFF0C;&#x4E0D;&#x4E71;&#x5403;&#x4E1C;&#x897F;&#x3002;<br>    6.&#x559C;&#x6B22;&#x548C;&#x5B69;&#x5B50;&#x73A9;&#x800D;&#xFF0C;&#x57F9;&#x517B;&#x5B69;&#x5B50;&#x7684;&#x7231;&#x5FC3;&#x3002;</p>
<p>&#x5982;&#x4F55;&#x8BA9;&#x72D7;&#x53D8;&#x5F97;&#x89C4;&#x77E9;&#xFF0C;&#x517B;&#x6210;&#x597D;&#x7684;&#x4E60;&#x60EF;&#x662F;&#x4E00;&#x4E2A;&#x5927;&#x96BE;&#x9898;&#xFF0C;&#x6BD5;&#x7ADF;&#x72D7;&#x7238;&#x72D7;&#x5988;&#x4EEC;&#x90FD;&#x6CA1;&#x6709;&#x592A;&#x591A;&#x4E13;&#x4E1A;&#x7684;&#x8BAD;&#x7EC3;&#x77E5;&#x8BC6;&#xFF0C;&#x5C31;&#x7B97;&#x7F51;&#x4E0A;&#x627E;&#x5230;&#x4E86;&#x76F8;&#x5173;&#x7684;&#x89C6;&#x9891;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x4E5F;&#x56E0;&#x592A;&#x5FD9;&#x6CA1;&#x65F6;&#x95F4;&#xFF0C;&#x6CA1;&#x8010;&#x5FC3;&#x575A;&#x6301;&#x53BB;&#x8BAD;&#x7EC3;&#x3002;&#x5018;&#x82E5;&#x6709;&#x95E8;&#x69DB;&#x8F83;&#x4F4E;&#x7684;&#x5BA0;&#x7269;&#x5B66;&#x6821;&#xFF0C;&#x8BA9;&#x5BB6;&#x517B;&#x5BA0;&#x7269;&#x72D7;&#x72D7;&#x5F97;&#x5230;&#x76F8;&#x5173;&#x4E13;&#x4E1A;&#x7684;&#x57F9;&#x8BAD;&#xFF0C;&#x4E8E;&#x4EBA;&#x4E8E;&#x72D7;&#x90FD;&#x662F;&#x4EF6;&#x597D;&#x4E8B;&#xFF0C;&#x4F46;&#x76EE;&#x524D;&#x8FD8;&#x53EA;&#x662F;&#x4E2A;&#x671F;&#x8BB8;&#xFF0C;&#x5F53;&#x7136;&#x51B3;&#x5B9A;&#x72D7;&#x72D7;&#x89C4;&#x4E0D;&#x89C4;&#x77E9;&#x7684;&#x6700;&#x6839;&#x672C;&#x56E0;&#x7D20;&#x8FD8;&#x662F;&#x72D7;&#x4E3B;&#x4EBA;&#xFF0C;&#x613F;&#x66F4;&#x591A;&#x7684;&#x5BA0;&#x7269;&#x72D7;&#x90FD;&#x80FD;&#x5F97;&#x5230;&#x9002;&#x5F53;&#x5730;&#x57F9;&#x8BAD;&#xFF0C;&#x89C4;&#x89C4;&#x77E9;&#x77E9;&#x505A;&#x72D7;&#xFF0C;&#x6210;&#x4E3A;&#x72D7;&#x7238;&#x72D7;&#x5988;&#x7684;&#x638C;&#x4E0A;&#x660E;&#x73E0;&#x3002;</p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">


</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2016/02/13/2016该学点什么？/" title="2016该学点什么(上)？" itemprop="url">2016该学点什么(上)？</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="EdwardGuo" target="_blank" itemprop="author">EdwardGuo</a>
		
  <p class="article-time">
    <time datetime="2016-02-13T05:09:46.000Z" itemprop="datePublished"> 發表於 2016-02-13</time>
    
  </p>
</header>
    <div class="article-content">
        
        <pre><code>&#x6625;&#x8282;&#x5047;&#x671F;&#x7ED3;&#x675F;&#xFF0C;&#x5F00;&#x59CB;2016&#x7684;&#x6D77;&#x6F02;&#x5F81;&#x7A0B;&#xFF0C;&#x6BCF;&#x5E74;&#x5E74;&#x521D;&#x90FD;&#x4F1A;&#x7ACB;&#x5FD7;&#x65B0;&#x4E00;&#x5E74;&#x91CC;&#x8981;&#x591A;&#x5B66;&#x4E60;&#xFF0C;&#x4F46;&#x662F;&#x5B66;&#x4EC0;&#x4E48;&#x8111;&#x6D77;&#x91CC;&#x4ECE;&#x6765;&#x6CA1;&#x6709;&#x4E00;&#x4E2A;&#x6E05;&#x6670;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x603B;&#x662F;&#x5F97;&#x4E34;&#x65F6;&#x53BB;&#x60F3;&#xFF0C;&#x800C;&#x6CA1;&#x6709;&#x4E00;&#x4E2A;&#x6E05;&#x6670;&#x7684;&#x5B66;&#x4E60;&#x8DEF;&#x7EBF;&#xFF0C;&#x4ECA;&#x5929;&#x82B1;&#x70B9;&#x65F6;&#x95F4;&#x68B3;&#x7406;&#x4E0B;2016&#x5E74;&#x81EA;&#x5DF1;&#x8981;&#x5B66;&#x4E60;&#x7684;&#x5185;&#x5BB9;&#x3002;
&#x4E00;&#xFF0C;&#x6280;&#x672F;-&#x751F;&#x5B58;&#x4E4B;&#x672C;
    &#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x5C0F;&#x767D;&#xFF0C;&#x603B;&#x7ED3;&#x4E00;&#x4E2A;&#x4E92;&#x8054;&#x7F51;&#x516C;&#x53F8;&#x9700;&#x8981;&#x7684;&#x6280;&#x672F;&#xFF1A;
    1.&#x540E;&#x7AEF;&#x8BED;&#x8A00;&#xFF1A;Java/php&#xFF0C;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#x7AEF;&#x5DE5;&#x7A0B;&#x5E08;&#xFF0C;Java&#x8BED;&#x8A00;&#x662F;&#x4E00;&#x5207;&#x7CFB;&#x7EDF;&#x7684;&#x8FD0;&#x884C;&#x4E4B;&#x672C;&#x3002;
    2.&#x4EE3;&#x7801;&#x7BA1;&#x7406;&#xFF1A;git,&#x56E2;&#x961F;&#x5F00;&#x53D1;&#x7684;&#x5FC5;&#x5907;&#x514D;&#x8D39;&#x5DE5;&#x5177;&#x3002;
    3.&#x7A0B;&#x5E8F;&#x90E8;&#x7F72;&#xFF1A;tomcat,&#x5982;&#x4F55;&#x53D1;&#x5E03;&#x7A0B;&#x5E8F;&#xFF0C;&#x5305;&#x62EC;web&#x7A0B;&#x5E8F;&#x548C;&#x670D;&#x52A1;&#x7AEF;&#x7A0B;&#x5E8F;&#x3002;
    4.&#x670D;&#x52A1;&#x8C03;&#x7528;&#xFF1A;pegion/dubbo/thrift&#xFF0C;Java&#x4E0B;&#x7684;RPC&#x6846;&#x67B6;&#xFF0C;&#x901A;&#x4FD7;&#x8BB2;&#x5C31;&#x662F;&#x7EDF;&#x4E00;&#x7BA1;&#x7406;&#x914D;&#x7F6E;&#x5404;&#x4E2A;&#x7CFB;&#x7EDF;&#x670D;&#x52A1;&#x95F4;&#x7684;&#x8C03;&#x7528;&#xFF0C;&#x8D77;&#x5230;&#x670D;&#x52A1;&#x6CBB;&#x7406;&#x7684;&#x4F5C;&#x7528;&#xFF0C;&#x5177;&#x4F53;&#x600E;&#x4E48;&#x5B9E;&#x73B0;&#xFF0C;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x3002;
    5.Linux:   &#x9700;&#x8981;&#x638C;&#x63E1;&#x57FA;&#x672C;&#x7684;linux&#x64CD;&#x4F5C;&#x547D;&#x4EE4;&#x548C;&#x5E38;&#x7528;&#x7684;&#x7684;shell&#x811A;&#x672C;&#x547D;&#x4EE4;&#x3002;
    6.IOS/Android: &#x5728;&#x79FB;&#x52A8;&#x7684;&#x8D8B;&#x52BF;&#x4E0B;&#xFF0C;&#x4E92;&#x8054;&#x7F51;&#x516C;&#x53F8;&#x5FC5;&#x987B;&#x9700;&#x8981;IOS/Anroid&#x5F00;&#x53D1;&#x5DE5;&#x7A0B;&#x5E08;&#xFF0C;Swift&#x4F1A;&#x662F;IOS&#x5F00;&#x53D1;&#x7684;&#x4E00;&#x4E2A;&#x8D8B;&#x52BF;&#x3002;
    7.&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#xFF1A;HTML5&#x5DF2;&#x7ECF;&#x88AB;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x91C7;&#x7EB3;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x638C;&#x63E1;HTML5&#x5BF9;&#x4E00;&#x5BB6;&#x4E92;&#x8054;&#x7F51;&#x516C;&#x53F8;&#x4E5F;&#x6781;&#x4E3A;&#x91CD;&#x8981;&#x3002;
    8.&#x6570;&#x636E;&#x5E93;&#xFF1A;  MySQL&#x5DF2;&#x7ECF;&#x6210;&#x4E3A;&#x7EDD;&#x5927;&#x90E8;&#x5206;&#x4E92;&#x8054;&#x7F51;&#x516C;&#x53F8;&#x7684;&#x5FC5;&#x5907;&#x514D;&#x8D39;&#x5F00;&#x6E90;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x638C;&#x63E1;&#x57FA;&#x672C;&#x7684;SQL&#x8BED;&#x53E5;&#xFF0C;&#x7D22;&#x5F15;&#x4F18;&#x5316;&#x65E0;&#x53EF;&#x539A;&#x975E;&#x3002;
    9.&#x7F13;&#x5B58;&#x77E5;&#x8BC6;&#xFF1A;memcache&#x6216;redis,&#x7F13;&#x5B58;&#x5728;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x80FD;&#x6781;&#x5927;&#x964D;&#x4F4E;&#x6570;&#x636E;&#x5E93;&#x7684;&#x538B;&#x529B;&#xFF0C;&#x5B66;&#x4F1A;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x7F13;&#x5B58;&#x5728;&#x5173;&#x952E;&#x65F6;&#x523B;&#x80FD;&#x5E26;&#x6765;&#x4E0D;&#x9519;&#x7684;&#x6548;&#x679C;&#x3002;
    10.&#x7F51;&#x7EDC;&#x901A;&#x4FE1;&#xFF1A;&#x7F51;&#x7EDC;&#x901A;&#x4FE1;&#x5BF9;&#x4E8E;&#x4E92;&#x8054;&#x7F51;&#x516C;&#x53F8;&#x4E4B;&#x95F4;&#x7684;&#x901A;&#x4FE1;&#x4E5F;&#x662F;&#x5FC5;&#x5907;&#x7684;&#xFF0C;&#x638C;&#x63E1;Http&#x4EE5;&#x53CA;Socket&#x7684;&#x77E5;&#x8BC6;&#x53EF;&#x4EE5;&#x4E0D;&#x5FC5;&#x516C;&#x53F8;&#x4E4B;&#x95F4;&#x8FDB;&#x884C;&#x5BF9;&#x63A5;&#x65F6;&#x62B1;&#x4F5B;&#x811A;&#x3002;
&#x4EE5;&#x4E0A;&#x4FBF;&#x662F;&#x52A0;&#x5165;&#x4E92;&#x8054;&#x7F51;1&#x5E74;&#x534A;&#x4EE5;&#x6765;&#x7684;&#x5207;&#x8EAB;&#x603B;&#x7ED3;&#xFF0C;&#x53EF;&#x80FD;&#x4E0D;&#x591F;&#x5168;&#xFF0C;&#x4F46;&#x57FA;&#x672C;&#x8986;&#x76D6;&#xFF0C;&#x90A3;&#x81EA;&#x5DF1;&#x8BE5;&#x5728;&#x54EA;&#x4E9B;&#x77E5;&#x8BC6;&#x4E0A;&#x52A0;&#x5F3A;&#xFF1F;&#x4E2A;&#x4EBA;&#x5BF9;&#x4E1A;&#x52A1;&#x8FD8;&#x6BD4;&#x8F83;&#x611F;&#x5174;&#x8DA3;&#xFF0C;&#x6240;&#x4EE5;&#x8FD8;&#x662F;&#x9700;&#x8981;&#x5728;&#x79BB;&#x4E1A;&#x52A1;&#x66F4;&#x8FD1;&#x7684;&#x77E5;&#x8BC6;&#x9886;&#x57DF;&#x52A0;&#x5F3A;&#xFF0C;&#x5373;Java/Http/IOS/H5/MySQL.

    Java&#x7684;&#x63D0;&#x5347;&#x8BA1;&#x5212;&#xFF1A;
    1&#xFF09;&#x4E60;&#x60EF;&#x6027;&#x603B;&#x7ED3;&#xFF1A;&#x5BF9;&#x4E8E;&#x6BCF;&#x6B21;&#x7684;&#x65B0;&#x53D1;&#x73B0;&#x53CA;&#x65F6;&#x603B;&#x7ED3;&#xFF0C;&#x4ECE;&#x4E8B;Java&#x5F00;&#x53D1;&#x8BB8;&#x4E45;&#xFF0C;&#x4F46;&#x662F;&#x77E5;&#x8BC6;&#x90FD;&#x662F;&#x96F6;&#x788E;&#x7684;&#xFF0C;&#x4E00;&#x76F4;&#x6CA1;&#x6709;&#x5F62;&#x6210;&#x4E00;&#x4E2A;&#x4F53;&#x7CFB;&#xFF0C;2016&#x5B66;&#x4F1A;&#x5B9A;&#x671F;&#x5199;&#x65E5;&#x5FD7;&#x603B;&#x7ED3;&#x3002;
    2&#xFF09;Java&#x6CE8;&#x91CA;&#x548C;&#x53CD;&#x5C04;&#xFF1A;Java&#x7684;Annotation&#x548C;Reflect&#x8FD9;2&#x4E2A;&#x5305;&#x4E00;&#x76F4;&#x4EE5;&#x6765;&#x662F;&#x4E2A;&#x76F2;&#x533A;&#xFF0C;2016&#x5E74;&#x4E0A;&#x534A;&#x5E74;&#x96C6;&#x4E2D;&#x4F18;&#x5148;&#x5B66;&#x4E60;&#x4E0B;&#xFF0C;&#x5E76;&#x4E14;&#x5F62;&#x6210;&#x65E5;&#x5FD7;&#x6587;&#x6863;&#x3002;
    3&#xFF09;&#x4EE3;&#x7801;&#x5DE5;&#x5177;&#x5316;&#xFF1A;&#x5B66;&#x4F1A;&#x5C06;&#x5E38;&#x7528;&#x7684;&#x4EE3;&#x7801;&#x5DE5;&#x5177;&#x5316;&#xFF0C;&#x5F62;&#x6210;&#x901A;&#x7528;&#x7684;&#x6A21;&#x5757;&#xFF0C;&#x51CF;&#x5C11;&#x91CD;&#x590D;&#x7684;&#x4EE3;&#x7801;&#x5F00;&#x53D1;&#x3002;
    4&#xFF09;Java&#x865A;&#x62DF;&#x673A;&#xFF1A;JVM&#x4E00;&#x76F4;&#x4EE5;&#x6765;&#x662F;&#x5F31;&#x70B9;&#xFF0C;&#x4E86;&#x89E3;JVM&#x53EF;&#x4EE5;&#x66F4;&#x597D;&#x5730;&#x5E94;&#x5BF9;&#x7CFB;&#x7EDF;&#x51FA;&#x73B0;&#x7684;&#x5F02;&#x5E38;&#xFF0C;&#x53CA;&#x65F6;&#x5B9A;&#x4F4D;&#x5E76;&#x4E14;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#xFF0C;JVM&#x7684;&#x5185;&#x5B58;&#x5206;&#x5E03;&#x57FA;&#x672C;&#x6E05;&#x695A;&#xFF0C;&#x9700;&#x8981;&#x8FDB;&#x4E00;&#x6B65;&#x4E86;&#x89E3;Java&#x5BF9;&#x8C61;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#x3002;
    5&#xFF09;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;&#xFF1A; &#x603B;&#x7ED3;&#x4E9B;&#x5408;&#x7406;&#x7684;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;&#x65B9;&#x6848;&#xFF0C;&#x5982;&#x4F55;&#x66F4;&#x52A0;&#x5408;&#x7406;&#x7684;&#x89E3;&#x8026;&#xFF0C;&#x540C;&#x65F6;&#x53C8;&#x4E0D;&#x81F3;&#x4E8E;&#x8FC7;&#x5206;&#x7684;&#x62C6;&#x5206;&#x3002;

    Swfit&#x63D0;&#x5347;&#x8BA1;&#x5212;&#xFF1A;
    1&#xFF09;Swift&#x7A7A;&#x95F4;&#x5E03;&#x5C40;&#xFF1A;&#x5B66;&#x4F1A;CollectionView&#x63A7;&#x4EF6;&#x548C;TableView&#x63A7;&#x4EF6;&#x7684;&#x5E03;&#x5C40;&#x3002;
    2&#xFF09;Swift&#x8C03;&#x7528;&#x670D;&#x52A1;&#xFF1A;&#x5B66;&#x4F1A;&#x5982;&#x4F55;Swfit&#x548C;Java&#x7684;&#x901A;&#x4FE1;&#x3002;

    MySQL&#x63D0;&#x5347;&#x8BA1;&#x5212;&#xFF1A;
    1&#xFF09;&#x5206;&#x5E93;&#x5206;&#x8868;&#xFF1A;2016&#x5E74;MySQL&#x7684;&#x4E3B;&#x8981;&#x63D0;&#x5347;&#x8BA1;&#x5212;&#x662F;&#x5206;&#x5E93;&#x5206;&#x8868;&#xFF0C;&#x5982;&#x4F55;&#x5C06;&#x4E00;&#x5F20;&#x5927;&#x8868;&#x5206;&#x6210;&#x591A;&#x5F20;&#x5C0F;&#x8868;&#xFF0C;&#x5E76;&#x4E14;&#x505A;&#x5230;&#x987A;&#x5229;&#x7684;&#x7070;&#x5EA6;&#x5207;&#x6362;&#xFF0C;2016&#x5E74;&#x628A;&#x8FD9;&#x4E2A;&#x505A;&#x597D;&#x5373;&#x53EF;&#x3002;
</code></pre>
        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">


</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2016/02/01/宠物也要懂规矩/" title="宠物也要懂规矩" itemprop="url">宠物也要懂规矩</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="EdwardGuo" target="_blank" itemprop="author">EdwardGuo</a>
		
  <p class="article-time">
    <time datetime="2016-02-01T15:06:08.000Z" itemprop="datePublished"> 發表於 2016-02-01</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p>&#x56DE;&#x6765;&#x7684;&#x8DEF;&#x4E0A;&#x770B;&#x5230;&#x4E00;&#x53EA;&#x5FAE;&#x7B11;&#x5929;&#x4F7F;&#x2013;&#x8428;&#x6469;&#x8036;&#x4E0D;&#x542C;&#x4E3B;&#x4EBA;&#x8BDD;&#x5230;&#x5904;&#x4E71;&#x55C5;&#x4E71;&#x8DD1;&#x88AB;&#x4E3B;&#x4EBA;&#x8BAD;&#x65A5;&#xFF0C;&#x4FBF;&#x60F3;&#x8D77;&#x5F53;&#x521D;&#x81EA;&#x5DF1;&#x5BF9;Blue&#x4E5F;&#x5E38;&#x5E38;&#x53D1;&#x813E;&#x6C14;&#xFF0C;&#x4E5F;&#x56E0;&#x4E3A;&#x4ED6;&#x4E0D;&#x542C;&#x8BDD;&#xFF0C;&#x5230;&#x5904;&#x4E71;&#x55C5;&#xFF0C;&#x89C1;&#x5230;&#x72D7;&#x5C31;&#x6FC0;&#x52A8;&#x4E0D;&#x5DF2;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x6BCD;&#x72D7;&#x3002;&#x4E2D;&#x56FD;&#x4EBA;&#x8D8A;&#x6765;&#x8D8A;&#x63A5;&#x6536;&#x5BA0;&#x7269;&#x7279;&#x522B;&#x662F;&#x72D7;&#x548C;&#x732B;&#xFF0C;&#x8FD9;&#x662F;&#x4E2A;&#x597D;&#x73B0;&#x8C61;&#xFF0C;&#x8BF4;&#x660E;&#x5927;&#x90E8;&#x5206;&#x56FD;&#x4EBA;&#x90FD;&#x662F;&#x5BCC;&#x6709;&#x7231;&#x5FC3;&#xFF0C;&#x540C;&#x65F6;&#x5BA2;&#x89C2;&#x7684;&#x8BB2;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x4E2D;&#x56FD;&#x7684;&#x5BA0;&#x7269;&#x7531;&#x4E8E;&#x7F3A;&#x4E4F;&#x5408;&#x9002;&#x7684;&#x57F9;&#x8BAD;&#xFF08;&#x77EB;&#x60C5;&#x70B9;&#x8BF4;&#x662F;&#x6559;&#x80B2;&#xFF09;&#xFF0C;&#x5BFC;&#x81F4;&#x4E86;&#x4E3B;&#x4EBA;&#x4F1A;&#x89C9;&#x5F97;&#x529B;&#x4E0D;&#x4ECE;&#x5FC3;&#xFF0C;&#x4EE5;&#x4E0B;&#x603B;&#x7ED3;&#x4E0B;&#x4E2D;&#x56FD;&#x5BA0;&#x7269;&#x72D7;&#x7684;&#x4E0D;&#x826F;&#x4E60;&#x60EF;&#xFF08;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x72D7;&#x7238;&#xFF0C;&#x7EDD;&#x5BF9;&#x6CA1;&#x6709;&#x534A;&#x70B9;&#x8BBD;&#x523A;&#x5BA0;&#x7269;&#x72D7;&#xFF09;<br>    1.&#x5BFC;&#x51FA;&#x4E71;&#x55C5;&#xFF1A;&#x8FD9;&#x53EF;&#x80FD;&#x6700;&#x5E38;&#x89C1;&#x5E76;&#x4E14;&#x6700;&#x4EE4;&#x72D7;&#x72D7;&#x70E6;&#x607C;&#x7684;&#x4E00;&#x4E2A;&#x4E0D;&#x826F;&#x4E60;&#x60EF;&#xFF0C;&#x867D;&#x8BF4;&#x662F;&#x72D7;&#x7684;&#x672C;&#x6027;&#xFF0C;&#x53D1;&#x73B0;&#x540C;&#x7C7B;&#x7684;&#x5473;&#x9053;&#x4F1A;&#x53BB;&#x95FB;&#x4E00;&#x4E0B;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x905B;&#x72D7;&#x7684;&#x65F6;&#x5019;&#x5018;&#x82E5;&#x72D7;&#x72D7;&#x80FD;&#x62AC;&#x5934;&#x5F80;&#x524D;&#x8D70;&#x90A3;&#x591A;&#x4E48;&#x6109;&#x5FEB;&#x3002;<br>    2.&#x968F;&#x5730;&#x6392;&#x4FBF;&#xFF1A;&#x867D;&#x7136;&#x5927;&#x90E8;&#x5206;&#x4E3B;&#x4EBA;&#x4F1A;&#x81EA;&#x5E26;&#x5851;&#x6599;&#x888B;&#x6536;&#x62FE;&#x72D7;&#x72D7;&#x7684;&#x6392;&#x4FBF;&#xFF0C;&#x4F46;&#x662F;&#x6BD5;&#x7ADF;&#x4E0D;&#x80FD;&#x5B8C;&#x5168;&#x6E05;&#x695A;&#x72D7;&#x72D7;&#x7684;&#x6392;&#x4FBF;&#xFF0C;&#x7279;&#x522B;&#x72D7;&#x72D7;&#x968F;&#x5904;&#x4E71;&#x6492;&#x5C3F;&#xFF0C;&#x7ED9;&#x8DEF;&#x4EBA;&#x4F1A;&#x5E26;&#x6765;&#x4E0D;&#x5FEB;&#xFF0C;&#x4E5F;&#x7ED9;&#x73AF;&#x5883;&#x5E26;&#x6765;&#x4E0D;&#x826F;&#x5F71;&#x54CD;&#x3002;<br>    3.&#x89C1;&#x5230;&#x72D7;&#x4FBF;&#x6FC0;&#x52A8;&#xFF1A;&#x7EDD;&#x5927;&#x90E8;&#x5206;&#x72D7;&#x89C1;&#x5230;&#x540C;&#x7C7B;&#x4E0D;&#x662F;&#x6FC0;&#x52A8;&#x7684;&#x4E71;&#x8DF3;&#x5C31;&#x662F;&#x9738;&#x9053;&#x7684;&#x4E71;&#x53EB;&#xFF0C;&#x905B;&#x72D7;&#x65F6;&#x8BA9;&#x5927;&#x90E8;&#x5206;&#x4E3B;&#x4EBA;&#x611F;&#x5230;&#x5FC3;&#x7D2F;&#xFF0C;&#x5018;&#x82E5;&#x72D7;&#x89C1;&#x5230;&#x540C;&#x7C7B;&#x80FD;&#x5B89;&#x9759;&#x7684;&#x4E0A;&#x6B21;&#x6253;&#x4E2A;&#x62DB;&#x547C;&#x90A3;&#x591A;&#x7F8E;&#x3002;<br>    4.&#x6251;&#x4EBA;&#xFF1A;&#x5F53;&#x9047;&#x5230;&#x70ED;&#x60C5;&#x7684;&#x7231;&#x72D7;&#x4EBA;&#x58EB;&#x65F6;&#xFF0C;&#x4F1A;&#x6FC0;&#x52A8;&#x6251;&#x4E0A;&#x53BB;&#xFF0C;&#x4E9B;&#x8BB8;&#x65F6;&#x5019;&#x4F1A;&#x5413;&#x5230;&#x522B;&#x4EBA;&#xFF0C;&#x5018;&#x82E5;&#x9047;&#x5230;&#x70ED;&#x60C5;&#x7684;&#x7231;&#x72D7;&#x4EBA;&#x58EB;&#x80FD;&#x6DE1;&#x5B9A;&#x8214;&#x8214;&#x5BF9;&#x65B9;&#x7684;&#x624B;&#x90A3;&#x8BE5;&#x591A;&#x597D;&#x3002;<br>    5.&#x6311;&#x98DF;&#xFF1A;&#x5927;&#x90E8;&#x5206;&#x72D7;&#x5403;&#x4E86;&#x597D;&#x7684;&#x4E1C;&#x897F;&#x4FBF;&#x4E0D;&#x7231;&#x5403;&#x72D7;&#x7CAE;&#xFF0C;&#x4E3B;&#x4EBA;&#x997F;&#x7740;&#x53C8;&#x5FC3;&#x75BC;&#xFF0C;&#x7ED9;&#x5403;&#x8089;&#x53C8;&#x8D35;&#x5BF9;&#x72D7;&#x672C;&#x8EAB;&#x53C8;&#x4E0D;&#x597D;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x4E00;&#x5927;&#x75DB;&#x70B9;&#x3002;<br>    6.&#x6253;&#x67B6;&#xFF1A;&#x6253;&#x67B6;&#x4E5F;&#x662F;&#x5F88;&#x591A;&#x5927;&#x72D7;&#x7684;&#x6076;&#x4E60;&#xFF0C;&#x91D1;&#x6BDB;&#xFF0C;&#x62C9;&#x5E03;&#x62C9;&#x591A;&#xFF0C;&#x8428;&#x6469;&#x5C24;&#x4E3A;&#x5E38;&#x89C1;&#xFF0C;&#x5927;&#x72D7;&#x5E38;&#x5E38;&#x4E3A;&#x4E86;&#x4E89;&#x62A2;&#x5E95;&#x76D8;&#x6216;&#x535A;&#x53D6;&#x6BCD;&#x72D7;&#x7684;&#x6B22;&#x5FC3;&#x800C;&#x6253;&#x67B6;&#xFF0C;&#x867D;&#x8BF4;&#x662F;&#x52A8;&#x7269;&#x7684;&#x672C;&#x80FD;&#xFF0C;&#x4F46;&#x6BD5;&#x7ADF;&#x662F;&#x5BA0;&#x7269;&#x72D7;&#xFF0C;&#x4E0D;&#x80FD;&#x6309;&#x7167;&#x672C;&#x80FD;&#x53BB;&#x8981;&#x6C42;&#x3002;</p>
<p>&#x4EE5;&#x4E0A;&#x662F;&#x56FD;&#x5185;&#x5BA0;&#x7269;&#x72D7;&#x7684;&#x4E0D;&#x826F;&#x4E60;&#x60EF;&#xFF0C;&#x5F53;&#x7136;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x5F88;&#x89C4;&#x77E9;&#x7684;&#x72D7;&#x72D7;&#xFF0C;&#x5982;&#x679C;&#x72D7;&#x72D7;&#x90FD;&#x80FD;&#x89C4;&#x89C4;&#x77E9;&#x77E9;&#xFF0C;&#x90A3;&#x4F1A;&#x7ED9;&#x57CE;&#x5E02;&#x751F;&#x6D3B;&#x5E26;&#x6765;&#x66F4;&#x591A;&#x4E50;&#x8DA3;&#xFF0C;&#x4E5F;&#x7ED9;&#x4E3B;&#x4EBA;&#x51CF;&#x5C11;&#x5F88;&#x591A;&#x70E6;&#x607C;&#xFF0C;&#x4E00;&#x6761;&#x7406;&#x60F3;&#x7684;&#x89C4;&#x77E9;&#x7684;&#x72D7;&#x5E94;&#x8BE5;&#x662F;&#xFF1A;<br>    1.&#x6027;&#x683C;&#x6E29;&#x987A;&#xFF0C;&#x4E0D;&#x9738;&#x9053;&#xFF0C;&#x4E0E;&#x72D7;&#x4E3A;&#x5584;&#x3002;<br>    2.&#x4E0D;&#x5BB9;&#x6613;&#x6FC0;&#x52A8;&#xFF0C;&#x4E0D;&#x7BA1;&#x89C1;&#x5230;&#x4EBA;&#x8FD8;&#x662F;&#x72D7;&#x3002;<br>    3.&#x62AC;&#x5934;&#x8D70;&#x8DEF;&#xFF0C;&#x62B5;&#x6297;&#x4F4F;&#x540C;&#x7C7B;&#x5473;&#x9053;&#x7684;&#x8BF1;&#x60D1;&#x4E0D;&#x5230;&#x5904;&#x4E71;&#x55C5;&#x3002;<br>    4.&#x4E0D;&#x968F;&#x5730;&#x5927;&#x5C0F;&#x4FBF;&#xFF0C;&#x80FD;&#x514B;&#x5236;&#xFF0C;&#x517B;&#x6210;&#x89C4;&#x5F8B;&#x7684;&#x6392;&#x4FBF;&#x4E60;&#x60EF;&#x3002;<br>    5.&#x4E0D;&#x6311;&#x98DF;&#xFF0C;&#x4E0D;&#x4E71;&#x5403;&#x4E1C;&#x897F;&#x3002;<br>    6.&#x559C;&#x6B22;&#x559D;&#x5B69;&#x5B50;&#x73A9;&#x800D;&#x3002;</p>
<p>&#x5982;&#x4F55;&#x8BA9;&#x72D7;&#x53D8;&#x5F97;&#x89C4;&#x77E9;&#xFF0C;&#x517B;&#x6210;&#x597D;&#x7684;&#x4E60;&#x60EF;&#x662F;&#x4E00;&#x4E2A;&#x5927;&#x96BE;&#x9898;&#xFF0C;&#x6BD5;&#x7ADF;&#x72D7;&#x7238;&#x72D7;&#x5988;&#x4EEC;&#x90FD;&#x6CA1;&#x6709;&#x592A;&#x591A;&#x4E13;&#x4E1A;&#x7684;&#x8BAD;&#x7EC3;&#x77E5;&#x8BC6;&#xFF0C;&#x5C31;&#x7B97;&#x7F51;&#x4E0A;&#x627E;&#x5230;&#x4E86;&#x76F8;&#x5173;&#x7684;&#x89C6;&#x9891;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x4E5F;&#x56E0;&#x592A;&#x5FD9;&#x6CA1;&#x65F6;&#x95F4;&#xFF0C;&#x6CA1;&#x8010;&#x5FC3;&#x575A;&#x6301;&#x53BB;&#x8BAD;&#x7EC3;&#x3002;&#x5018;&#x82E5;&#x6709;&#x95E8;&#x69DB;&#x8F83;&#x4F4E;&#x7684;&#x5BA0;&#x7269;&#x5B66;&#x6821;&#xFF0C;&#x8BA9;&#x5BB6;&#x517B;&#x5BA0;&#x7269;&#x72D7;&#x72D7;&#x5F97;&#x5230;&#x76F8;&#x5173;&#x4E13;&#x4E1A;&#x7684;&#x57F9;&#x8BAD;&#xFF0C;&#x4E8E;&#x4EBA;&#x4E8E;&#x72D7;&#x90FD;&#x662F;&#x4EF6;&#x597D;&#x4E8B;&#xFF0C;&#x4F46;&#x76EE;&#x524D;&#x8FD8;&#x53EA;&#x662F;&#x4E2A;&#x671F;&#x8BB8;&#xFF0C;&#x5F53;&#x7136;&#x51B3;&#x5B9A;&#x72D7;&#x72D7;&#x89C4;&#x4E0D;&#x89C4;&#x77E9;&#x7684;&#x6700;&#x6839;&#x672C;&#x56E0;&#x7D20;&#x8FD8;&#x662F;&#x72D7;&#x4E3B;&#x4EBA;&#xFF0C;&#x613F;&#x66F4;&#x591A;&#x7684;&#x5BA0;&#x7269;&#x72D7;&#x90FD;&#x80FD;&#x5F97;&#x5230;&#x9002;&#x5F53;&#x5730;&#x57F9;&#x8BAD;&#xFF0C;&#x89C4;&#x89C4;&#x77E9;&#x77E9;&#x505A;&#x72D7;&#xFF0C;&#x6210;&#x4E3A;&#x72D7;&#x7238;&#x72D7;&#x5988;&#x7684;&#x638C;&#x4E0A;&#x660E;&#x73E0;&#x3002;</p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">


</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2016/01/31/Lniux下循环使用Curl脚本/" title="Linux下循环使用Curl命令" itemprop="url">Linux下循环使用Curl命令</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="EdwardGuo" target="_blank" itemprop="author">EdwardGuo</a>
		
  <p class="article-time">
    <time datetime="2016-01-31T11:48:20.000Z" itemprop="datePublished"> 發表於 2016-01-31</time>
    
  </p>
</header>
    <div class="article-content">
        
        <pre><code>1.&#x5173;&#x4E8E;curl
&#x518D;&#x8BF4;curl&#x6709;&#x5FC5;&#x8981;&#x4E86;&#x89E3;&#x4E0B;libcurl,&#x6458;&#x81EA;wikipedia &quot;libcurl is a free client-side URL transfer library, supporting, FTP, FTPS, HTTP, HTTPS, SCP, Telent..&quot;,&#x4E5F;&#x5C31;&#x662F;&#x8FD9;&#x8BF4;libcurl&#x662F;&#x4E2A;URL&#x7684;&#x4F20;&#x8F93;&#x5DE5;&#x5177;&#x5305;&#xFF0C;&#x652F;&#x6301;&#x5404;&#x79CD;&#x534F;&#x8BAE;&#x7684;&#x4F20;&#x8F93;&#x5E76;&#x4E14;&#x662F;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#xFF0C;&#x800C;curl&#x4E0D;&#x8FC7;&#x662F;libcurl&#x7684;&#x4E00;&#x4E2A;&#x547D;&#x4EE4;&#x800C;&#x5DF2;&#xFF0C;curl&#x6700;&#x5E38;&#x7528;&#x7684;&#x65B9;&#x5F0F;&#x4FBF;&#x662F;curl www.example.com &#x7528;&#x4E8E;&#x83B7;&#x53D6;&#x8BE5;url&#x7684;&#x7F51;&#x9875;&#x5185;&#x5BB9;&#x3002;
&#x4EE5;&#x4E0B;&#x4E3A;curl&#x7684;&#x5E38;&#x7528;&#x53C2;&#x6570;
curl -o /tmp/sina.html http://www.sina.com.cn/ : &#x5C06;&#x65B0;&#x6D6A;&#x4E3B;&#x9875;&#x7684;&#x5185;&#x5BB9;&#x6293;&#x53D6;&#x4E0B;&#x6765;&#x5E76;&#x5B58;&#x653E;&#x5230;&#x672C;&#x5730;&#x7684;tmp&#x76EE;&#x5F55;&#x4E0B;&#x3002;
curl -I http://www.sina.com.cn/ :&#x53EA;&#x663E;&#x793A;&#x6587;&#x6863;&#x4FE1;&#x606F;&#xFF0C;&#x4E0D;&#x663E;&#x793A;&#x5168;&#x90E8;&#x5185;&#x5BB9;&#xFF0C;&#x4E3B;&#x8981;&#x7528;&#x4E8E;&#x5224;&#x65AD;&#x8BE5;url&#x662F;&#x5426;OK&#x3002;
curl -X POST http://www.sina.com.cn/: curl&#x9ED8;&#x8BA4;&#x7684;http&#x8BF7;&#x6C42;&#x65B9;&#x5F0F;&#x662F;GET&#xFF0C;-x&#x53C2;&#x6570;&#x53EF;&#x4EE5;&#x6539;&#x53D8;http&#x8BF7;&#x6C42;&#x65B9;&#x5F0F;&#x3002;

&#x5173;&#x4E8E;curl&#x7684;&#x5E38;&#x7528;&#x4F7F;&#x7528;&#x65B9;&#x5F0F;&#x5C31;&#x8FD9;&#x4E9B;&#xFF0C;&#x4E0B;&#x9762;&#x770B;&#x770B;&#x5982;&#x4F55;&#x5728;linux&#x4E0B;&#x5FAA;&#x73AF;&#x4F7F;&#x7528;curl,&#x4E3B;&#x8981;&#x662F;linux&#x4E2D;while&#x548C;for&#x5FAA;&#x73AF;&#x7684;&#x5D4C;&#x5957;&#x4F7F;&#x7528;&#x3002;

2.while&#x5FAA;&#x73AF;&#x548C;for&#x5FAA;&#x73AF;&#x7684;&#x5D4C;&#x5957;&#x4F7F;&#x7528;&#x3002;
&#x5E9F;&#x8BDD;&#x4E0D;&#x591A;&#x8BF4;&#xFF0C;&#x6765;&#x4E2A;&#x5B9E;&#x4F8B;&#x573A;&#x666F;&#xFF0C;&#x6211;&#x60F3;&#x770B;&#x770B;&#x5927;&#x4F17;&#x70B9;&#x8BC4;&#x7F51;&#x662F;&#x4E0D;&#x662F;&#x6BCF;&#x4E2A;&#x57CE;&#x5E02;&#x90FD;&#x6709;&#x5BF9;&#x5E94;&#x7684;&#x4E3B;&#x9875;&#xFF0C;&#x601D;&#x8DEF;&#x5982;&#x4E0B;&#xFF1A;
    a.&#x901A;&#x8FC7;while&#x5FAA;&#x73AF;&#x8BFB;&#x53D6;&#x57CE;&#x5E02;&#x5217;&#x8868;&#xFF0C;&#x6BCF;&#x4E00;&#x884C;&#x4E2D;&#x6709;&#x591A;&#x4E2A;&#x57CE;&#x5E02;&#x901A;&#x8FC7;&#x9017;&#x53F7;&#x5206;&#x9694;&#x3002;
    b.&#x5728;while&#x5FAA;&#x73AF;&#x4E2D;&#xFF0C;&#x6BCF;&#x8BFB;&#x4E00;&#x884C;&#xFF0C;for&#x5FAA;&#x73AF;&#x8BFB;&#x53D6;&#x8FD9;&#x4E00;&#x884C;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x57CE;&#x5E02;&#x3002;
    c.&#x6BCF;&#x8BFB;&#x4E00;&#x4E2A;&#x57CE;&#x5E02;&#x901A;&#x8FC7;curl -I&#x6765;&#x83B7;&#x53D6;&#x8FD4;&#x56DE;HTTP&#x8BF7;&#x6C42;&#x4FE1;&#x606F;&#x3002;
    d.&#x6253;&#x5370;&#x7ED3;&#x675F;&#xFF0C;&#x6CE8;&#x610F;echo &#x540E;&#x8981;&#x52A0;&#x4E00;&#x4E2A;&#x7A7A;&#x683C;&#x3002;

&#x770B;&#x770B;&#x4EE3;&#x7801;&#xFF1A;

#!bin/bash
#curl&#x7684;&#x5C0F;&#x5DE5;&#x5177;
#cityList=&quot;shanghai,dalian,beijing,qingdao,nanchang,taiyuan&quot;
RESULTFILE=&quot;/tmp/HttpCityCodeNew.txt&quot;
IFS=&quot;,&quot;
echo &quot;----------&#x5F00;&#x59CB;&#x8BFB;&#x53D6;&#x57CE;&#x5E02;&#x5217;&#x8868;&#x6587;&#x4EF6;----------&quot;
cat $1 | while read line
do
    for city in $line
    do
            curl http://www.dianping.com/$city -I &gt;&gt; $RESULTFILE
    done
    echo &quot;--------------&#x7ED3;&#x675F;&#x4E00;&#x884C;&#x7684;&#x8BFB;&#x53D6;--------------&quot;
done
echo &quot;---------------&#x7ED3;&#x675F;&#x6240;&#x6709;&#x7684;&#x8BFB;&#x53D6;----------------&quot;
</code></pre>
        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">


</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2016/01/31/Linux下循环使用Curl脚本/" title="Linux下循环使用Curl命令" itemprop="url">Linux下循环使用Curl命令</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="EdwardGuo" target="_blank" itemprop="author">EdwardGuo</a>
		
  <p class="article-time">
    <time datetime="2016-01-31T11:48:20.000Z" itemprop="datePublished"> 發表於 2016-01-31</time>
    
  </p>
</header>
    <div class="article-content">
        
        <pre><code>1.&#x5173;&#x4E8E;curl
&#x518D;&#x8BF4;curl&#x6709;&#x5FC5;&#x8981;&#x4E86;&#x89E3;&#x4E0B;libcurl,&#x6458;&#x81EA;wikipedia &quot;libcurl is a free client-side URL transfer library, supporting, FTP, FTPS, HTTP, HTTPS, SCP, Telent..&quot;,&#x4E5F;&#x5C31;&#x662F;&#x8FD9;&#x8BF4;libcurl&#x662F;&#x4E2A;URL&#x7684;&#x4F20;&#x8F93;&#x5DE5;&#x5177;&#x5305;&#xFF0C;&#x652F;&#x6301;&#x5404;&#x79CD;&#x534F;&#x8BAE;&#x7684;&#x4F20;&#x8F93;&#x5E76;&#x4E14;&#x662F;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#xFF0C;&#x800C;curl&#x4E0D;&#x8FC7;&#x662F;libcurl&#x7684;&#x4E00;&#x4E2A;&#x547D;&#x4EE4;&#x800C;&#x5DF2;&#xFF0C;curl&#x6700;&#x5E38;&#x7528;&#x7684;&#x65B9;&#x5F0F;&#x4FBF;&#x662F;curl www.example.com &#x7528;&#x4E8E;&#x83B7;&#x53D6;&#x8BE5;url&#x7684;&#x7F51;&#x9875;&#x5185;&#x5BB9;&#x3002;
&#x4EE5;&#x4E0B;&#x4E3A;curl&#x7684;&#x5E38;&#x7528;&#x53C2;&#x6570;
curl -o /tmp/sina.html http://www.sina.com.cn/ : &#x5C06;&#x65B0;&#x6D6A;&#x4E3B;&#x9875;&#x7684;&#x5185;&#x5BB9;&#x6293;&#x53D6;&#x4E0B;&#x6765;&#x5E76;&#x5B58;&#x653E;&#x5230;&#x672C;&#x5730;&#x7684;tmp&#x76EE;&#x5F55;&#x4E0B;&#x3002;
curl -I http://www.sina.com.cn/ :&#x53EA;&#x663E;&#x793A;&#x6587;&#x6863;&#x4FE1;&#x606F;&#xFF0C;&#x4E0D;&#x663E;&#x793A;&#x5168;&#x90E8;&#x5185;&#x5BB9;&#xFF0C;&#x4E3B;&#x8981;&#x7528;&#x4E8E;&#x5224;&#x65AD;&#x8BE5;url&#x662F;&#x5426;OK&#x3002;
curl -X POST http://www.sina.com.cn/: curl&#x9ED8;&#x8BA4;&#x7684;http&#x8BF7;&#x6C42;&#x65B9;&#x5F0F;&#x662F;GET&#xFF0C;-x&#x53C2;&#x6570;&#x53EF;&#x4EE5;&#x6539;&#x53D8;http&#x8BF7;&#x6C42;&#x65B9;&#x5F0F;&#x3002;

&#x5173;&#x4E8E;curl&#x7684;&#x5E38;&#x7528;&#x4F7F;&#x7528;&#x65B9;&#x5F0F;&#x5C31;&#x8FD9;&#x4E9B;&#xFF0C;&#x4E0B;&#x9762;&#x770B;&#x770B;&#x5982;&#x4F55;&#x5728;linux&#x4E0B;&#x5FAA;&#x73AF;&#x4F7F;&#x7528;curl,&#x4E3B;&#x8981;&#x662F;linux&#x4E2D;while&#x548C;for&#x5FAA;&#x73AF;&#x7684;&#x5D4C;&#x5957;&#x4F7F;&#x7528;&#x3002;

2.while&#x5FAA;&#x73AF;&#x548C;for&#x5FAA;&#x73AF;&#x7684;&#x5D4C;&#x5957;&#x4F7F;&#x7528;&#x3002;
&#x5E9F;&#x8BDD;&#x4E0D;&#x591A;&#x8BF4;&#xFF0C;&#x6765;&#x4E2A;&#x5B9E;&#x4F8B;&#x573A;&#x666F;&#xFF0C;&#x6211;&#x60F3;&#x770B;&#x770B;&#x5927;&#x4F17;&#x70B9;&#x8BC4;&#x7F51;&#x662F;&#x4E0D;&#x662F;&#x6BCF;&#x4E2A;&#x57CE;&#x5E02;&#x90FD;&#x6709;&#x5BF9;&#x5E94;&#x7684;&#x4E3B;&#x9875;&#xFF0C;&#x601D;&#x8DEF;&#x5982;&#x4E0B;&#xFF1A;
    a.&#x901A;&#x8FC7;while&#x5FAA;&#x73AF;&#x8BFB;&#x53D6;&#x57CE;&#x5E02;&#x5217;&#x8868;&#xFF0C;&#x6BCF;&#x4E00;&#x884C;&#x4E2D;&#x6709;&#x591A;&#x4E2A;&#x57CE;&#x5E02;&#x901A;&#x8FC7;&#x9017;&#x53F7;&#x5206;&#x9694;&#x3002;
    b.&#x5728;while&#x5FAA;&#x73AF;&#x4E2D;&#xFF0C;&#x6BCF;&#x8BFB;&#x4E00;&#x884C;&#xFF0C;for&#x5FAA;&#x73AF;&#x8BFB;&#x53D6;&#x8FD9;&#x4E00;&#x884C;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x57CE;&#x5E02;&#x3002;
    c.&#x6BCF;&#x8BFB;&#x4E00;&#x4E2A;&#x57CE;&#x5E02;&#x901A;&#x8FC7;curl -I&#x6765;&#x83B7;&#x53D6;&#x8FD4;&#x56DE;HTTP&#x8BF7;&#x6C42;&#x4FE1;&#x606F;&#x3002;
    d.&#x6253;&#x5370;&#x7ED3;&#x675F;&#xFF0C;&#x6CE8;&#x610F;echo &#x540E;&#x8981;&#x52A0;&#x4E00;&#x4E2A;&#x7A7A;&#x683C;&#x3002;

&#x770B;&#x770B;&#x4EE3;&#x7801;&#xFF1A;

#!bin/bash
#curl&#x7684;&#x5C0F;&#x5DE5;&#x5177;
#cityList=&quot;shanghai,dalian,beijing,qingdao,nanchang,taiyuan&quot;
RESULTFILE=&quot;/tmp/HttpCityCodeNew.txt&quot;
IFS=&quot;,&quot;
echo &quot;----------&#x5F00;&#x59CB;&#x8BFB;&#x53D6;&#x57CE;&#x5E02;&#x5217;&#x8868;&#x6587;&#x4EF6;----------&quot;
cat $1 | while read line
do
    for city in $line
    do
            curl http://www.dianping.com/$city -I &gt;&gt; $RESULTFILE
    done
    echo &quot;--------------&#x7ED3;&#x675F;&#x4E00;&#x884C;&#x7684;&#x8BFB;&#x53D6;--------------&quot;
done
echo &quot;---------------&#x7ED3;&#x675F;&#x6240;&#x6709;&#x7684;&#x8BFB;&#x53D6;----------------&quot;
</code></pre>
        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">


</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2016/01/31/深入分析Volatile/" title="深入分析Volatile" itemprop="url">深入分析Volatile</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="EdwardGuo" target="_blank" itemprop="author">EdwardGuo</a>
		
  <p class="article-time">
    <time datetime="2016-01-31T07:23:17.000Z" itemprop="datePublished"> 發表於 2016-01-31</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p>&#x5728;&#x8FDB;&#x5165;volatile&#x4E4B;&#x524D;&#xFF0C;&#x54B1;&#x4EEC;&#x5148;&#x666E;&#x53CA;&#x51E0;&#x4E2A;&#x672F;&#x8BED;<br>    1.&#x5171;&#x4EAB;&#x53D8;&#x91CF;&#xFF1A;&#x5728;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x4E4B;&#x95F4;&#x80FD;&#x591F;&#x88AB;&#x5171;&#x4EAB;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x5305;&#x62EC;&#x5B9E;&#x4F8B;&#x53D8;&#x91CF;&#xFF0C;&#x9759;&#x6001;&#x53D8;&#x91CF;&#x548C;&#x6570;&#x7EC4;&#x5143;&#x7D20;&#xFF0C;&#x5B9E;&#x4F8B;&#x53D8;&#x91CF;&#x90FD;&#x88AB;&#x653E;&#x5728;&#x5806;&#x5185;&#x5B58;&#x4E2D;&#xFF0C;volatile&#x53EA;&#x4F5C;&#x7528;&#x4E8E;&#x5171;&#x4EAB;&#x53D8;&#x91CF;&#x3002;<br>    2.&#x5185;&#x5B58;&#x5C4F;&#x969C;&#xFF1A;memory barriers&#x662F;&#x4E00;&#x7EC4;&#x6307;&#x4EE4;&#xFF0C;&#x7528;&#x4E8E;&#x5B9E;&#x73B0;&#x5BF9;&#x5185;&#x5B58;&#x64CD;&#x4F5C;&#x7684;&#x987A;&#x5E8F;&#x9650;&#x5236;&#x3002;<br>    3.&#x7F13;&#x51B2;&#x884C;&#xFF1A;Cache line&#xFF0C;&#x7F13;&#x5B58;&#x4E2D;&#x53EF;&#x4EE5;&#x5206;&#x914D;&#x7684;&#x6700;&#x5C0F;&#x5B58;&#x50A8;&#x5355;&#x5143;&#xFF0C;<br>    4.&#x539F;&#x5B50;&#x64CD;&#x4F5C;&#xFF1A;Atomic operations &#x4E0D;&#x53EF;&#x4E2D;&#x65AD;&#x7684;&#x4E00;&#x4E2A;&#x6216;&#x4E00;&#x7CFB;&#x5217;&#x64CD;&#x4F5C;&#x3002;<br>    5.&#x7F13;&#x5B58;&#x884C;&#x586B;&#x5145;&#xFF1A;cache line fill &#x5F53;&#x5904;&#x7406;&#x5668;&#x8BC6;&#x522B;&#x5230;&#x4ECE;&#x5185;&#x5B58;&#x4E2D;&#x8BFB;&#x53D6;&#x64CD;&#x4F5C;&#x6570;&#x662F;&#x53EF;&#x4EE5;&#x7F13;&#x5B58;&#x7684;&#xFF0C;&#x5904;&#x7406;&#x5668;&#x8BFB;&#x53D6;&#x6574;&#x4E2A;&#x7F13;&#x51B2;&#x884C;&#x5230;&#x9002;&#x5F53;&#x7684;&#x7F13;&#x5B58;&#x3002;<br>    6.&#x7F13;&#x5B58;&#x547D;&#x4E2D;&#xFF1A;cache hit &#x5982;&#x679C;&#x8FDB;&#x884C;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x884C;&#x586B;&#x5145;&#x7684;&#x5185;&#x5B58;&#x4F4D;&#x7F6E;&#x4ECD;&#x7136;&#x662F;&#x4E0B;&#x6B21;&#x8BBF;&#x95EE;&#x7684;&#x5730;&#x5740;&#x65F6;&#xFF0C;&#x5904;&#x7406;&#x5668;&#x4ECE;&#x7F13;&#x5B58;&#x4E2D;&#x8BFB;&#x53D6;&#x64CD;&#x4F5C;&#x6570;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4ECE;&#x5185;&#x5B58;&#x4E2D;&#x3002;<br>    7.&#x5199;&#x547D;&#x4E2D;&#xFF1A;write hit &#x5F53;&#x5904;&#x7406;&#x5668;&#x5C06;&#x64CD;&#x4F5C;&#x6570;&#x5199;&#x56DE;&#x5230;&#x4E00;&#x4E2A;&#x5185;&#x5B58;&#x7F13;&#x5B58;&#x533A;&#x57DF;&#x65F6;&#xFF0C;&#x4ED6;&#x4F1A;&#x5148;&#x68C0;&#x67E5;&#x8FD9;&#x4E2A;&#x7F13;&#x5B58;&#x7684;&#x5185;&#x5B58;&#x5730;&#x5740;&#x662F;&#x5426;&#x5728;&#x7F13;&#x5B58;&#x884C;&#x4E2D;&#xFF0C;<br>      &#x5982;&#x679C;&#x5B58;&#x5728;&#x4E00;&#x4E2A;&#x6709;&#x6548;&#x7684;&#x7F13;&#x5B58;&#x884C;&#xFF0C;&#x5219;&#x5904;&#x7406;&#x5668;&#x4F1A;&#x5C06;&#x8FD9;&#x4E2A;&#x64CD;&#x4F5C;&#x6570;&#x5199;&#x5165;&#x7F13;&#x5B58;&#x800C;&#x4E0D;&#x662F;&#x5185;&#x5B58;&#x4E2D;</p>
<p>&#x63A5;&#x4E0B;&#x6765;&#x770B;&#x770B;&#x5728;&#x7ED9;&#x4E00;&#x4E2A;&#x5171;&#x4EAB;&#x53D8;&#x91CF;&#x52A0;&#x4E86;volatile&#x4FEE;&#x9970;&#x4E4B;&#x540E;&#x4F1A;&#x53D1;&#x751F;&#x4EC0;&#x4E48;&#x64CD;&#x4F5C;&#xFF1A;<br>    Java &#x4EE3;&#x7801;&#xFF1A; private volatile Boolean isShutdown;<br>    &#x6C47;&#x7F16;&#x4EE3;&#x7801;&#xFF1A;  0x01a3de1d: movb $0&#xD7;0,0&#xD7;1104800(%esi);<br>               0x01a3de24: lock addl $0&#xD7;0,(%esp);<br>&#x52A0;&#x4E86;volatile&#x4F11;&#x606F;&#x662F;&#x7684;&#x5171;&#x4EAB;&#x53D8;&#x91CF;&#xFF0C;&#x4F1A;&#x591A;&#x4E00;&#x884C;&#x6C47;&#x7F16;&#x4EE3;&#x7801;&#x2013;lock&#x524D;&#x7F00;&#xFF0C;&#x8FD9;&#x4E2A;lock&#x524D;&#x7F00;&#x5728;&#x591A;&#x6838;&#x5904;&#x7406;&#x5668;&#x4E0B;&#x4F1A;&#x53D1;&#x751F;2&#x4EF6;&#x4E8B;&#x60C5;&#xFF1A;<br>    1.&#x5C06;&#x5F53;&#x524D;&#x5904;&#x7406;&#x5668;&#x7F13;&#x5B58;&#x884C;&#x7684;&#x6570;&#x636E;&#x4F1A;&#x5199;&#x5230;&#x7CFB;&#x7EDF;&#x5185;&#x5B58;&#x3002;<br>    2.&#x8FD9;&#x4E2A;&#x4F1A;&#x5199;&#x5185;&#x5B58;&#x7684;&#x64CD;&#x4F5C;&#x4F1A;&#x5F15;&#x8D77;&#x5176;&#x4ED6;CPU&#x91CC;&#x7F13;&#x5B58;&#x4E86;&#x8BE5;&#x5185;&#x5B58;&#x5730;&#x5740;&#x7684;&#x6570;&#x636E;&#x5931;&#x6548;&#x3002;<br>&#x7531;&#x4E8E;&#x5728;&#x591A;&#x6838;&#x5904;&#x7406;&#x5668;&#x4E2D;&#xFF0C;&#x4E3A;&#x4E86;&#x63D0;&#x9AD8;&#x5904;&#x7406;&#x5668;&#x901F;&#x5EA6;&#xFF0C;&#x5904;&#x7406;&#x5668;&#x4E0D;&#x76F4;&#x63A5;&#x548C;&#x5185;&#x5B58;&#x8FDB;&#x884C;&#x901A;&#x8BAF;&#xFF0C;&#x800C;&#x662F;&#x5148;&#x5C06;&#x5185;&#x5B58;&#x7684;&#x6570;&#x636E;&#x8BFB;&#x5230;&#x5185;&#x90E8;&#x7F13;&#x5B58;&#x540E;&#x518D;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#xFF0C;&#x64CD;&#x4F5C;&#x540E;&#x53C8;&#x5199;&#x4F1A;&#x7F13;&#x5B58;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x77E5;&#x9053;&#x4F55;&#x65F6;&#x4F1A;&#x5199;&#x56DE;&#x5185;&#x5B58;&#xFF0C;<br>&#x8FD9;&#x6837;&#x5176;&#x4ED6;&#x5904;&#x7406;&#x5668;&#x4FBF;&#x770B;&#x4E0D;&#x5230;&#x8FD9;&#x4E2A;&#x64CD;&#x4F5C;&#x7684;&#x6539;&#x53D8;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x7ED9;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x52A0;&#x4E86;volatile&#x4FEE;&#x9970;&#xFF0C;&#x90A3;&#x4E48;&#x5728;&#x8FDB;&#x884C;&#x5199;&#x64CD;&#x4F5C;&#x65F6;&#xFF0C;JVM&#x865A;&#x62DF;&#x673A;&#x4F1A;&#x7ED9;&#x5904;&#x7406;&#x5668;&#x53D1;&#x4E00;&#x6761;Lock&#x524D;&#x7F00;&#x7684;&#x6307;&#x4EE4;&#xFF0C;&#x4FC3;&#x53D1;&#x5F53;&#x524D;&#x7684;&#x5199;&#x64CD;&#x4F5C;&#x4F1A;<br>&#x5199;&#x81F3;&#x5185;&#x5B58;&#xFF0C;&#x4F1A;&#x5199;&#x4E4B;&#x5185;&#x5B58;&#x540E;&#xFF0C;&#x7531;&#x4E8E;&#x591A;&#x6838;&#x5904;&#x7406;&#x5668;&#x5B9E;&#x73B0;&#x4E86;&#x7F13;&#x5B58;&#x4E00;&#x81F4;&#x6027;&#x534F;&#x8BAE;&#xFF0C;&#x6BCF;&#x4E2A;&#x5904;&#x7406;&#x5668;&#x901A;&#x8FC7;&#x55C5;&#x63A2;&#x76D1;&#x6D4B;&#x5728;&#x603B;&#x7EBF;&#x4E0A;&#x4F20;&#x64AD;&#x8FC7;&#x6765;&#x7684;&#x6570;&#x636E;&#x6765;&#x68C0;&#x67E5;&#x81EA;&#x5DF1;&#x7684;&#x7F13;&#x5B58;&#x662F;&#x5426;&#x5DF2;&#x5931;&#x6548;&#xFF0C;&#x5F53;&#x5904;&#x7406;&#x5668;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x7F13;&#x5B58;&#x884C;<br>&#x7684;&#x5BF9;&#x5E94;&#x5185;&#x5B58;&#x5730;&#x5740;&#x53D1;&#x751F;&#x6539;&#x53D8;&#x4E86;&#xFF0C;&#x4FBF;&#x4F1A;&#x628A;&#x5904;&#x7406;&#x5668;&#x5F53;&#x524D;&#x7684;&#x7F13;&#x5B58;&#x884C;&#x7F6E;&#x4E3A;&#x5DF2;&#x5931;&#x6548;&#x72B6;&#x6001;&#xFF0C;&#x540C;&#x65F6;&#x5C06;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x5199;&#x5165;&#x7F13;&#x5B58;&#x3002;<br>    &#x672F;&#x8BED;&#x592A;&#x590D;&#x6742;&#xFF0C;&#x603B;&#x7ED3;&#x4E0B;&#x6765;&#x5373;&#x4E3A;&#x5982;&#x4E0B;<br>    &#x7ED9;&#x53D8;&#x91CF;&#x6DFB;&#x52A0;volatile&#x4FEE;&#x9970;&#x2014;&gt;&#x5199;&#x64CD;&#x4F5C;&#x65F6;JVM&#x53D1;&#x9001;Lock&#x524D;&#x7F00;&#x6307;&#x4EE4;&#x2014;&gt;&#x5F53;&#x524D;&#x7684;&#x5199;&#x64CD;&#x4F5C;&#x56DE;&#x5199;&#x81F3;&#x7CFB;&#x7EDF;&#x5185;&#x5B58;&#x2014;&gt;&#x5176;&#x4ED6;&#x5904;&#x7406;&#x76D1;&#x542C;&#x5230;&#x603B;&#x7EBF;&#x7684;&#x6570;&#x636E;&#x53D8;&#x5316;&#x5BFC;&#x81F4;&#x7F13;&#x5B58;&#x884C;&#x5931;&#x6548;&#x2014;&gt;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x5C06;&#x7CFB;&#x7EDF;<br>    &#x5185;&#x5B58;&#x6570;&#x636E;&#x5199;&#x5165;&#x7F13;&#x5B58;&#x2014;&gt;&#x4ECE;&#x800C;&#x4FDD;&#x8BC1;&#x6570;&#x636E;&#x4E00;&#x81F4;&#x6027;&#x3002;</p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">


</div>




<div class="comments-count">
	
</div>

</footer>


    </article>







  <nav id="page-nav" class="clearfix">
    <span class="page-number current">1</span><a class="page-number" href="/page/2/">2</a><a class="extend next" rel="next" href="/page/2/">Next<span></span></a>
  </nav>

</div>
      <div class="openaside"><a class="navbutton" href="#" title="顯示側邊欄"></a></div>

<div id="asidepart">
<div class="closeaside"><a class="closebutton" href="#" title="隱藏側邊欄"></a></div>
<aside class="clearfix">

  


  

  

  <div class="linkslist">
  <p class="asidetitle">友情鏈接</p>
    <ul>
        
          <li>
            
            	<a href="https://coderq.com" target="_blank" title="一个面向程序员交流分享的新一代社区">码农圈</a>
            
          </li>
        
          <li>
            
            	<a href="http://wuchong.me" target="_blank" title="Jark&#39;s Blog">Jark&#39;s Blog</a>
            
          </li>
        
    </ul>
</div>

  


  <div class="rsspart">
	<a href="/atom.xml" target="_blank" title="rss">RSS 訂閱</a>
</div>

  <div class="weiboshow">
  <p class="asidetitle">新浪微博</p>
    <iframe width="100%" height="119" class="share_self"  frameborder="0" scrolling="no" src="http://widget.weibo.com/weiboshow/index.php?language=&width=0&height=119&fansRow=2&ptype=1&speed=0&skin=9&isTitle=1&noborder=1&isWeibo=0&isFans=0&uid=null&verifier=b3593ceb&dpc=1"></iframe>
</div>


</aside>
</div>
    </div>
    <footer><div id="footer" >
	
	<div class="line">
		<span></span>
		<div class="author"></div>
	</div>
	
	
	<section class="info">
		<p> 天青色等烟雨 <br/>
			而我在等你</p>
	</section>
	 
	<div class="social-font" class="clearfix">
		
		<a href="http://weibo.com/2176287895" target="_blank" class="icon-weibo" title="微博"></a>
		
		
		
		
		
		
		
		
		
		
	</div>
			
		

		<p class="copyright">
		Powered by <a href="http://hexo.io" target="_blank" title="hexo">hexo</a> and Theme by <a href="https://github.com/wuchong/jacman" target="_blank" title="Jacman">Jacman</a> © 2016 
		
		<a href="/about" target="_blank" title="EdwardGuo">EdwardGuo</a>
		
		
		</p>
</div>
</footer>
    <script src="/js/jquery-2.0.3.min.js"></script>
<script src="/js/jquery.imagesloaded.min.js"></script>
<script src="/js/gallery.js"></script>
<script src="/js/jquery.qrcode-0.12.0.min.js"></script>

<script type="text/javascript">
$(document).ready(function(){ 
  $('.navbar').click(function(){
    $('header nav').toggleClass('shownav');
  });
  var myWidth = 0;
  function getSize(){
    if( typeof( window.innerWidth ) == 'number' ) {
      myWidth = window.innerWidth;
    } else if( document.documentElement && document.documentElement.clientWidth) {
      myWidth = document.documentElement.clientWidth;
    };
  };
  var m = $('#main'),
      a = $('#asidepart'),
      c = $('.closeaside'),
      o = $('.openaside');
  c.click(function(){
    a.addClass('fadeOut').css('display', 'none');
    o.css('display', 'block').addClass('fadeIn');
    m.addClass('moveMain');
  });
  o.click(function(){
    o.css('display', 'none').removeClass('beforeFadeIn');
    a.css('display', 'block').removeClass('fadeOut').addClass('fadeIn');      
    m.removeClass('moveMain');
  });
  $(window).scroll(function(){
    o.css("top",Math.max(80,260-$(this).scrollTop()));
  });
  
  $(window).resize(function(){
    getSize(); 
    if (myWidth >= 1024) {
      $('header nav').removeClass('shownav');
    }else{
      m.removeClass('moveMain');
      a.css('display', 'block').removeClass('fadeOut');
      o.css('display', 'none');
        
    }
  });
});
</script>










<link rel="stylesheet" href="/fancybox/jquery.fancybox.css" media="screen" type="text/css">
<script src="/fancybox/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
$(document).ready(function(){ 
  $('.article-content').each(function(i){
    $(this).find('img').each(function(){
      if ($(this).parent().hasClass('fancybox')) return;
      var alt = this.alt;
      if (alt) $(this).after('<span class="caption">' + alt + '</span>');
      $(this).wrap('<a href="' + this.src + '" title="' + alt + '" class="fancybox"></a>');
    });
    $(this).find('.fancybox').each(function(){
      $(this).attr('rel', 'article' + i);
    });
  });
  if($.fancybox){
    $('.fancybox').fancybox();
  }
}); 
</script>



<!-- Analytics Begin -->



<script>
var _hmt = _hmt || [];
(function() {
  var hm = document.createElement("script");
  hm.src = "//hm.baidu.com/hm.js?e6d1f421bbc9962127a50488f9ed37d1";
  var s = document.getElementsByTagName("script")[0]; 
  s.parentNode.insertBefore(hm, s);
})();
</script>



<!-- Analytics End -->

<!-- Totop Begin -->

	<div id="totop">
	<a title="返回頂部"><img src="/img/scrollup.png"/></a>
	</div>
	<script src="/js/totop.js"></script>

<!-- Totop End -->

<!-- MathJax Begin -->
<!-- mathjax config similar to math.stackexchange -->


<!-- MathJax End -->

<!-- Tiny_search Begin -->

<!-- Tiny_search End -->

  </body>
 </html>
