
 <!DOCTYPE HTML>
<html lang="libing2012.guo@gmail.com">
<head>
  <meta charset="UTF-8">
  
    <title>天生爱跑</title>
    <meta name="viewport" content="width=device-width, initial-scale=1,user-scalable=no">
    
    <meta name="author" content="EdwardGuo">
    

    
    <meta name="description">
<meta property="og:type" content="website">
<meta property="og:title" content="天生爱跑">
<meta property="og:url" content="http://yoursite.com/page/2/index.html">
<meta property="og:site_name" content="天生爱跑">
<meta property="og:description">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="天生爱跑">
<meta name="twitter:description">

    
    <link rel="alternative" href="/atom.xml" title="天生爱跑" type="application/atom+xml">
    
    
    <link rel="icon" href="/img/favicon.ico">
    
    
    <link rel="apple-touch-icon" href="/img/golden.jpg">
    <link rel="apple-touch-icon-precomposed" href="/img/golden.jpg">
    
    <link rel="stylesheet" href="/css/style.css" type="text/css">
</head>

  <body>
    <header>
      
<div>
		
			<div id="imglogo">
				<a href="/"><img src="/img/logo.png" alt="天生爱跑" title="天生爱跑"/></a>
			</div>
			
			<div id="textlogo">
				<h1 class="site-name"><a href="/" title="天生爱跑">天生爱跑</a></h1>
				<h2 class="blog-motto"></h2>
			</div>
			<div class="navbar"><a class="navbutton navmobile" href="#" title="菜單">
			</a></div>
			<nav class="animated">
				<ul>
					<ul>
					 
						<li><a href="/">Home</a></li>
					
						<li><a href="/archives">Archives</a></li>
					
						<li><a href="/about">About</a></li>
					
					<li>
 					
					<form class="search" action="//google.com/search" method="get" accept-charset="utf-8">
						<label>Search</label>
						<input type="search" id="search" name="q" autocomplete="off" maxlength="20" placeholder="搜索" />
						<input type="hidden" name="q" value="site:yoursite.com">
					</form>
					
					</li>
				</ul>
			</nav>			
</div>
    </header>
    <div id="container">
      <div id="main">

   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2016/01/31/深入分析Volatile/" title="深入分析Volatile" itemprop="url">深入分析Volatile</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="EdwardGuo" target="_blank" itemprop="author">EdwardGuo</a>
		
  <p class="article-time">
    <time datetime="2016-01-31T07:23:17.000Z" itemprop="datePublished"> 發表於 2016-01-31</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p>&#x5728;&#x8FDB;&#x5165;volatile&#x4E4B;&#x524D;&#xFF0C;&#x54B1;&#x4EEC;&#x5148;&#x666E;&#x53CA;&#x51E0;&#x4E2A;&#x672F;&#x8BED;<br>    1.&#x5171;&#x4EAB;&#x53D8;&#x91CF;&#xFF1A;&#x5728;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x4E4B;&#x95F4;&#x80FD;&#x591F;&#x88AB;&#x5171;&#x4EAB;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x5305;&#x62EC;&#x5B9E;&#x4F8B;&#x53D8;&#x91CF;&#xFF0C;&#x9759;&#x6001;&#x53D8;&#x91CF;&#x548C;&#x6570;&#x7EC4;&#x5143;&#x7D20;&#xFF0C;&#x5B9E;&#x4F8B;&#x53D8;&#x91CF;&#x90FD;&#x88AB;&#x653E;&#x5728;&#x5806;&#x5185;&#x5B58;&#x4E2D;&#xFF0C;volatile&#x53EA;&#x4F5C;&#x7528;&#x4E8E;&#x5171;&#x4EAB;&#x53D8;&#x91CF;&#x3002;<br>    2.&#x5185;&#x5B58;&#x5C4F;&#x969C;&#xFF1A;memory barriers&#x662F;&#x4E00;&#x7EC4;&#x6307;&#x4EE4;&#xFF0C;&#x7528;&#x4E8E;&#x5B9E;&#x73B0;&#x5BF9;&#x5185;&#x5B58;&#x64CD;&#x4F5C;&#x7684;&#x987A;&#x5E8F;&#x9650;&#x5236;&#x3002;<br>    3.&#x7F13;&#x51B2;&#x884C;&#xFF1A;Cache line&#xFF0C;&#x7F13;&#x5B58;&#x4E2D;&#x53EF;&#x4EE5;&#x5206;&#x914D;&#x7684;&#x6700;&#x5C0F;&#x5B58;&#x50A8;&#x5355;&#x5143;&#xFF0C;<br>    4.&#x539F;&#x5B50;&#x64CD;&#x4F5C;&#xFF1A;Atomic operations &#x4E0D;&#x53EF;&#x4E2D;&#x65AD;&#x7684;&#x4E00;&#x4E2A;&#x6216;&#x4E00;&#x7CFB;&#x5217;&#x64CD;&#x4F5C;&#x3002;<br>    5.&#x7F13;&#x5B58;&#x884C;&#x586B;&#x5145;&#xFF1A;cache line fill &#x5F53;&#x5904;&#x7406;&#x5668;&#x8BC6;&#x522B;&#x5230;&#x4ECE;&#x5185;&#x5B58;&#x4E2D;&#x8BFB;&#x53D6;&#x64CD;&#x4F5C;&#x6570;&#x662F;&#x53EF;&#x4EE5;&#x7F13;&#x5B58;&#x7684;&#xFF0C;&#x5904;&#x7406;&#x5668;&#x8BFB;&#x53D6;&#x6574;&#x4E2A;&#x7F13;&#x51B2;&#x884C;&#x5230;&#x9002;&#x5F53;&#x7684;&#x7F13;&#x5B58;&#x3002;<br>    6.&#x7F13;&#x5B58;&#x547D;&#x4E2D;&#xFF1A;cache hit &#x5982;&#x679C;&#x8FDB;&#x884C;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x884C;&#x586B;&#x5145;&#x7684;&#x5185;&#x5B58;&#x4F4D;&#x7F6E;&#x4ECD;&#x7136;&#x662F;&#x4E0B;&#x6B21;&#x8BBF;&#x95EE;&#x7684;&#x5730;&#x5740;&#x65F6;&#xFF0C;&#x5904;&#x7406;&#x5668;&#x4ECE;&#x7F13;&#x5B58;&#x4E2D;&#x8BFB;&#x53D6;&#x64CD;&#x4F5C;&#x6570;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4ECE;&#x5185;&#x5B58;&#x4E2D;&#x3002;<br>    7.&#x5199;&#x547D;&#x4E2D;&#xFF1A;write hit &#x5F53;&#x5904;&#x7406;&#x5668;&#x5C06;&#x64CD;&#x4F5C;&#x6570;&#x5199;&#x56DE;&#x5230;&#x4E00;&#x4E2A;&#x5185;&#x5B58;&#x7F13;&#x5B58;&#x533A;&#x57DF;&#x65F6;&#xFF0C;&#x4ED6;&#x4F1A;&#x5148;&#x68C0;&#x67E5;&#x8FD9;&#x4E2A;&#x7F13;&#x5B58;&#x7684;&#x5185;&#x5B58;&#x5730;&#x5740;&#x662F;&#x5426;&#x5728;&#x7F13;&#x5B58;&#x884C;&#x4E2D;&#xFF0C;<br>      &#x5982;&#x679C;&#x5B58;&#x5728;&#x4E00;&#x4E2A;&#x6709;&#x6548;&#x7684;&#x7F13;&#x5B58;&#x884C;&#xFF0C;&#x5219;&#x5904;&#x7406;&#x5668;&#x4F1A;&#x5C06;&#x8FD9;&#x4E2A;&#x64CD;&#x4F5C;&#x6570;&#x5199;&#x5165;&#x7F13;&#x5B58;&#x800C;&#x4E0D;&#x662F;&#x5185;&#x5B58;&#x4E2D;</p>
<p>&#x63A5;&#x4E0B;&#x6765;&#x770B;&#x770B;&#x5728;&#x7ED9;&#x4E00;&#x4E2A;&#x5171;&#x4EAB;&#x53D8;&#x91CF;&#x52A0;&#x4E86;volatile&#x4FEE;&#x9970;&#x4E4B;&#x540E;&#x4F1A;&#x53D1;&#x751F;&#x4EC0;&#x4E48;&#x64CD;&#x4F5C;&#xFF1A;<br>    Java &#x4EE3;&#x7801;&#xFF1A; private volatile Boolean isShutdown;<br>    &#x6C47;&#x7F16;&#x4EE3;&#x7801;&#xFF1A;  0x01a3de1d: movb $0&#xD7;0,0&#xD7;1104800(%esi);<br>               0x01a3de24: lock addl $0&#xD7;0,(%esp);<br>&#x52A0;&#x4E86;volatile&#x4F11;&#x606F;&#x662F;&#x7684;&#x5171;&#x4EAB;&#x53D8;&#x91CF;&#xFF0C;&#x4F1A;&#x591A;&#x4E00;&#x884C;&#x6C47;&#x7F16;&#x4EE3;&#x7801;&#x2013;lock&#x524D;&#x7F00;&#xFF0C;&#x8FD9;&#x4E2A;lock&#x524D;&#x7F00;&#x5728;&#x591A;&#x6838;&#x5904;&#x7406;&#x5668;&#x4E0B;&#x4F1A;&#x53D1;&#x751F;2&#x4EF6;&#x4E8B;&#x60C5;&#xFF1A;<br>    1.&#x5C06;&#x5F53;&#x524D;&#x5904;&#x7406;&#x5668;&#x7F13;&#x5B58;&#x884C;&#x7684;&#x6570;&#x636E;&#x4F1A;&#x5199;&#x5230;&#x7CFB;&#x7EDF;&#x5185;&#x5B58;&#x3002;<br>    2.&#x8FD9;&#x4E2A;&#x4F1A;&#x5199;&#x5185;&#x5B58;&#x7684;&#x64CD;&#x4F5C;&#x4F1A;&#x5F15;&#x8D77;&#x5176;&#x4ED6;CPU&#x91CC;&#x7F13;&#x5B58;&#x4E86;&#x8BE5;&#x5185;&#x5B58;&#x5730;&#x5740;&#x7684;&#x6570;&#x636E;&#x5931;&#x6548;&#x3002;<br>&#x7531;&#x4E8E;&#x5728;&#x591A;&#x6838;&#x5904;&#x7406;&#x5668;&#x4E2D;&#xFF0C;&#x4E3A;&#x4E86;&#x63D0;&#x9AD8;&#x5904;&#x7406;&#x5668;&#x901F;&#x5EA6;&#xFF0C;&#x5904;&#x7406;&#x5668;&#x4E0D;&#x76F4;&#x63A5;&#x548C;&#x5185;&#x5B58;&#x8FDB;&#x884C;&#x901A;&#x8BAF;&#xFF0C;&#x800C;&#x662F;&#x5148;&#x5C06;&#x5185;&#x5B58;&#x7684;&#x6570;&#x636E;&#x8BFB;&#x5230;&#x5185;&#x90E8;&#x7F13;&#x5B58;&#x540E;&#x518D;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#xFF0C;&#x64CD;&#x4F5C;&#x540E;&#x53C8;&#x5199;&#x4F1A;&#x7F13;&#x5B58;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x77E5;&#x9053;&#x4F55;&#x65F6;&#x4F1A;&#x5199;&#x56DE;&#x5185;&#x5B58;&#xFF0C;<br>&#x8FD9;&#x6837;&#x5176;&#x4ED6;&#x5904;&#x7406;&#x5668;&#x4FBF;&#x770B;&#x4E0D;&#x5230;&#x8FD9;&#x4E2A;&#x64CD;&#x4F5C;&#x7684;&#x6539;&#x53D8;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x7ED9;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x52A0;&#x4E86;volatile&#x4FEE;&#x9970;&#xFF0C;&#x90A3;&#x4E48;&#x5728;&#x8FDB;&#x884C;&#x5199;&#x64CD;&#x4F5C;&#x65F6;&#xFF0C;JVM&#x865A;&#x62DF;&#x673A;&#x4F1A;&#x7ED9;&#x5904;&#x7406;&#x5668;&#x53D1;&#x4E00;&#x6761;Lock&#x524D;&#x7F00;&#x7684;&#x6307;&#x4EE4;&#xFF0C;&#x4FC3;&#x53D1;&#x5F53;&#x524D;&#x7684;&#x5199;&#x64CD;&#x4F5C;&#x4F1A;<br>&#x5199;&#x81F3;&#x5185;&#x5B58;&#xFF0C;&#x4F1A;&#x5199;&#x4E4B;&#x5185;&#x5B58;&#x540E;&#xFF0C;&#x7531;&#x4E8E;&#x591A;&#x6838;&#x5904;&#x7406;&#x5668;&#x5B9E;&#x73B0;&#x4E86;&#x7F13;&#x5B58;&#x4E00;&#x81F4;&#x6027;&#x534F;&#x8BAE;&#xFF0C;&#x6BCF;&#x4E2A;&#x5904;&#x7406;&#x5668;&#x901A;&#x8FC7;&#x55C5;&#x63A2;&#x76D1;&#x6D4B;&#x5728;&#x603B;&#x7EBF;&#x4E0A;&#x4F20;&#x64AD;&#x8FC7;&#x6765;&#x7684;&#x6570;&#x636E;&#x6765;&#x68C0;&#x67E5;&#x81EA;&#x5DF1;&#x7684;&#x7F13;&#x5B58;&#x662F;&#x5426;&#x5DF2;&#x5931;&#x6548;&#xFF0C;&#x5F53;&#x5904;&#x7406;&#x5668;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x7F13;&#x5B58;&#x884C;<br>&#x7684;&#x5BF9;&#x5E94;&#x5185;&#x5B58;&#x5730;&#x5740;&#x53D1;&#x751F;&#x6539;&#x53D8;&#x4E86;&#xFF0C;&#x4FBF;&#x4F1A;&#x628A;&#x5904;&#x7406;&#x5668;&#x5F53;&#x524D;&#x7684;&#x7F13;&#x5B58;&#x884C;&#x7F6E;&#x4E3A;&#x5DF2;&#x5931;&#x6548;&#x72B6;&#x6001;&#xFF0C;&#x540C;&#x65F6;&#x5C06;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x5199;&#x5165;&#x7F13;&#x5B58;&#x3002;<br>    &#x672F;&#x8BED;&#x592A;&#x590D;&#x6742;&#xFF0C;&#x603B;&#x7ED3;&#x4E0B;&#x6765;&#x5373;&#x4E3A;&#x5982;&#x4E0B;<br>    &#x7ED9;&#x53D8;&#x91CF;&#x6DFB;&#x52A0;volatile&#x4FEE;&#x9970;&#x2014;&gt;&#x5199;&#x64CD;&#x4F5C;&#x65F6;JVM&#x53D1;&#x9001;Lock&#x524D;&#x7F00;&#x6307;&#x4EE4;&#x2014;&gt;&#x5F53;&#x524D;&#x7684;&#x5199;&#x64CD;&#x4F5C;&#x56DE;&#x5199;&#x81F3;&#x7CFB;&#x7EDF;&#x5185;&#x5B58;&#x2014;&gt;&#x5176;&#x4ED6;&#x5904;&#x7406;&#x76D1;&#x542C;&#x5230;&#x603B;&#x7EBF;&#x7684;&#x6570;&#x636E;&#x53D8;&#x5316;&#x5BFC;&#x81F4;&#x7F13;&#x5B58;&#x884C;&#x5931;&#x6548;&#x2014;&gt;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x5C06;&#x7CFB;&#x7EDF;<br>    &#x5185;&#x5B58;&#x6570;&#x636E;&#x5199;&#x5165;&#x7F13;&#x5B58;&#x2014;&gt;&#x4ECE;&#x800C;&#x4FDD;&#x8BC1;&#x6570;&#x636E;&#x4E00;&#x81F4;&#x6027;&#x3002;</p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">


</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2016/01/31/Do-you-really-need-to-Buy-a-car/" title="Do you really need to Buy a car" itemprop="url">Do you really need to Buy a car</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="EdwardGuo" target="_blank" itemprop="author">EdwardGuo</a>
		
  <p class="article-time">
    <time datetime="2016-01-31T06:27:35.000Z" itemprop="datePublished"> 發表於 2016-01-31</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p>&#x4E70;&#x8F66;&#x8FD9;&#x4E2A;&#x60F3;&#x6CD5;&#x5DF2;&#x7ECF;&#x6709;&#x4E86;1&#x5E74;&#x591A;&#x4E86;&#xFF0C;&#x62FF;&#x5230;&#x9A7E;&#x7167;&#x4E5F;&#x5DF2;&#x7ECF;&#x4E00;&#x5E74;&#x534A;&#x4E86;&#xFF0C;&#x4ECE;&#x4E00;&#x5F00;&#x59CB;&#x60F3;&#x4E70;&#x65B0;&#x8F66;&#x5230;&#x6700;&#x8FD1;&#x72B9;&#x8C6B;&#x4E70;&#x4E8C;&#x624B;&#x8F66;&#xFF0C;&#x7F3A;&#x4E00;&#x76F4;&#x6CA1;&#x6709;&#x8861;&#x91CF;&#x6E05;&#x695A;&#x4E70;&#x8F66;&#x7684;&#x5229;&#x4E0E;&#x5F0A;&#xFF0C;&#x6211;&#x60F3;&#x5927;&#x90E8;&#x5206;28&#xFF0C;9&#x5C81;&#x7684;&#x5355;&#x8EAB;&#x5E74;&#x8F7B;&#x4EBA;&#x5E94;&#x8BE5;&#x548C;&#x6211;&#x4E00;&#x6837;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x4E0A;&#x7EA0;&#x7ED3;&#x8FC7;&#xFF0C;&#x4E0B;&#x9762;&#x5206;&#x6790;&#x4E0B;&#x5229;&#x5F0A;&#x3002;<br>    &#x4E70;&#x8F66;&#x80FD;&#x5E26;&#x6765;&#x4EC0;&#x4E48;&#x597D;&#x5904;&#xFF1F;<br>    1.&#x6700;&#x76F4;&#x63A5;&#x7684;&#x597D;&#x5904;&#x6EE1;&#x8DB3;&#x5F00;&#x8F66;&#x7684;&#x64CD;&#x4F5C;&#x611F;&#xFF0C;&#x5F00;&#x8F66;&#x5BF9;&#x5E74;&#x8F7B;&#x4EBA;&#x6765;&#x8BF4;&#x4E5F;&#x662F;&#x4E00;&#x79CD;&#x4E50;&#x8DA3;&#xFF0C;&#x4EAB;&#x53D7;&#x90A3;&#x79CD;&#x901F;&#x5EA6;&#x5E26;&#x6765;&#x7684;&#x6FC0;&#x60C5;&#x3002;<br>    2.&#x751F;&#x6D3B;&#x54C1;&#x8D28;&#x7684;&#x63D0;&#x9AD8;&#xFF0C;&#x540C;&#x65F6;&#x5E26;&#x6765;&#x4FBF;&#x5229;&#xFF0C;&#x4E0B;&#x96E8;&#x5929;&#x51FA;&#x95E8;&#x6709;&#x4E2A;&#x8F66;&#x4F1A;&#x65B9;&#x4FBF;&#x5F88;&#x591A;&#xFF0C;&#x4E0D;&#x7528;&#x4E3A;&#x6253;&#x4E0D;&#x5230;&#x8F66;&#x70E6;&#x607C;&#x3002;<br>    3.&#x5BF9;&#x5355;&#x8EAB;&#x670B;&#x53CB;&#x6765;&#x8BF4;&#xFF0C;&#x6709;&#x8F66;&#x53EF;&#x4EE5;&#x4E3A;&#x627E;&#x5BF9;&#x8C61;&#x52A0;&#x5206;&#xFF0C;&#x59B9;&#x5B50;&#x9700;&#x8981;&#x8F66;&#x7684;&#x65F6;&#x5019;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x4FBF;&#x5229;&#x3002;<br>    4.&#x56DE;&#x8001;&#x5BB6;&#x65B9;&#x4FBF;&#xFF0C;&#x540C;&#x65F6;&#x56DE;&#x53BB;&#x4E5F;&#x4F1A;&#x6709;&#x4E9B;&#x9762;&#x5B50;&#x3002;</p>
<pre><code>&#x4EE5;&#x4E0A;&#x662F;&#x4E70;&#x8F66;&#x5E26;&#x6765;&#x7684;&#x597D;&#x5904;&#xFF0C;&#x597D;&#x50CF;&#x4E5F;&#x60F3;&#x4E0D;&#x51FA;&#x6765;&#x66F4;&#x591A;&#x4E86;&#xFF0C;&#x4E0B;&#x9762;&#x770B;&#x770B;&#x4E70;&#x8F66;&#x5E26;&#x6765;&#x7684;&#x6D88;&#x8D39;&#x3002;

1.&#x6700;&#x76F4;&#x63A5;&#x7684;&#x6D88;&#x8017;&#x662F;&#x4E70;&#x8F66;&#x94B1;10&#x4E07;&#x5757;&#x5DE6;&#x53F3;&#xFF0C;&#x8FD9;10&#x4E07;&#x5757;&#x53EF;&#x80FD;&#x5728;&#x4E70;&#x623F;&#x7684;&#x65F6;&#x5019;&#x80FD;&#x8D77;&#x5230;&#x5173;&#x952E;&#x4F5C;&#x7528;&#x3002;
2.&#x5176;&#x6B21;&#x4E00;&#x5E74;&#x6CB9;&#x94B1;&#x505C;&#x8F66;&#x8D39;&#x52A0;&#x8D77;&#x6765;2&#x4E07;&#x5757;&#xFF0C;&#x867D;&#x7136;&#x4E0D;&#x591A;&#xFF0C;&#x7B97;&#x7B97;&#x597D;&#x50CF;&#x4E5F;&#x4E0D;&#x591A;&#x3002;
3.&#x505C;&#x8F66;&#x96BE;&#x505C;&#x8F66;&#x96BE;&#x505C;&#x8F66;&#x96BE;....&#x867D;&#x7136;&#x5F00;&#x8F66;&#x65B9;&#x4FBF;&#x4F46;&#x662F;&#x5728;&#x4E0A;&#x6D77;&#x505C;&#x8F66;&#x5B9E;&#x5728;&#x592A;&#x96BE;.
4.&#x5835;&#x8F66;&#x662F;&#x53E6;&#x5916;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x4EA4;&#x901A;&#x592A;&#x5835;&#xFF0C;&#x5373;&#x4F7F;&#x4E70;&#x8F66;&#x4E86;&#x4E5F;&#x53EA;&#x80FD;&#x5468;&#x672B;&#x5F00;&#x5F00;&#xFF0C;&#x4E0A;&#x4E0B;&#x73ED;&#x53EF;&#x80FD;&#x90FD;&#x4E0D;&#x80FD;&#x5F00;&#x8F66;&#x3002;
</code></pre><p>&#x4EE5;&#x4E0A;&#x4FBF;&#x662F;&#x5229;&#x5F0A;&#xFF0C;&#x5F53;&#x7136;&#x5982;&#x679C;&#x4E70;&#x8F86;&#x4FDD;&#x6709;&#x91CF;&#x5927;&#x7684;&#x8F66;&#xFF0C;&#x5F00;&#x4E2A;1&#xFF0C;2&#x5E74;&#x5356;&#x6389;&#x8F6C;&#x624B;&#xFF0C;&#x6210;&#x672C;&#x53EF;&#x80FD;&#x5C31;4&#xFF0C;5&#x4E07;&#x4E5F;&#x4E0D;&#x7B97;&#x592A;&#x5DEE;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x89C9;&#x5F97;&#x4E0D;&#x7528;&#x7EA0;&#x7ED3;&#x592A;&#x591A;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x505C;&#x8F66;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x90A3;&#x5C31;&#x4E70;&#x8D77;&#x6765;&#x3002;</p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">


</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2016/01/07/ClassNotFound-VS-NoClassDef/" title="ClassNotFound VS NoClassDef" itemprop="url">ClassNotFound VS NoClassDef</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="EdwardGuo" target="_blank" itemprop="author">EdwardGuo</a>
		
  <p class="article-time">
    <time datetime="2016-01-07T11:45:12.000Z" itemprop="datePublished"> 發表於 2016-01-07</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p>The difference between ClassNotFoundException and NoClassDefFoundError</p>
<pre><code>--ClassNotFoundException
Thrown when an application tries to load in a class through its string name using 
    1) Class.forname() method in class Class.
    2) ClassLoader.findSystemClass method in class ClassLoader.
    3) ClassLoader.loadClass() in class ClassLoader.
As for ClassNotFoundException, it appears that it may stem from trying to make reflective calls to classes at runtime, but the classes the program is trying to call is does not exist.


--NoClassDefFoundError
Thrown if the JVM or a ClassLoader instance tries to load in the definition of a class but no definition could be found.
So, it appears that the NoClassDefFoundError occurs when the source was successfully compiled, but at runtime, the required class files were not found. This may be something that can happen in the distribution or production of JAR files, where not all the required class files were included.
Usually happened when a ref is not found in a class
</code></pre>
        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">


</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2016/01/03/2016最想做的十件事情/" title="2016最想做的十件事情" itemprop="url">2016最想做的十件事情</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="EdwardGuo" target="_blank" itemprop="author">EdwardGuo</a>
		
  <p class="article-time">
    <time datetime="2016-01-03T12:39:37.000Z" itemprop="datePublished"> 發表於 2016-01-03</time>
    
  </p>
</header>
    <div class="article-content">
        
        <pre><code>2016&#x5E74;&#x5DF2;&#x81F3;&#xFF0C;&#x518D;&#x8FC7;2&#x5E74;&#x5C31;&#x4E09;&#x5341;&#x800C;&#x7ACB;&#x4E86;&#xFF0C;&#x5E0C;&#x671B;2&#x5E74;&#x540E;&#x81EA;&#x5DF1;&#x518D;&#x56DE;&#x9996;&#x65F6;&#xFF0C;&#x5C11;&#x4E9B;&#x9057;&#x61BE;&#x5C11;&#x4E9B;&#x540E;&#x6094;&#xFF0C;&#x60F3;&#x6E05;&#x695A;30&#x5C81;&#x4E4B;&#x524D;&#x6700;&#x60F3;&#x5B9E;&#x73B0;&#x7684;&#x5C0F;&#x5E78;&#x8FD0;&#xFF0C;
&#x6765;&#x8BF4;&#x8BF4;&#x6700;&#x60F3;&#x505A;&#x7684;10&#x4EF6;&#x4E8B;&#x5427;&#x3002;

1.&#x627E;&#x5230;&#x81EA;&#x5DF1;soul-mate&#xFF0C;&#x5982;&#x679C;&#x8BF4;&#x521A;&#x6BD5;&#x4E1A;&#x65F6;&#x6CA1;&#x94B1;&#xFF0C;&#x6BD5;&#x4E1A;&#x540E;&#x53C8;&#x5FD9;&#x4E8E;&#x5DE5;&#x4F5C;&#xFF0C;&#x5982;&#x4ECA;&#xFF0C;&#x5DE5;&#x4F5C;&#x5DF2;&#x7ECF;4&#x5E74;&#x534A;&#xFF0C;&#x6211;&#x60F3;2016&#x5E74;&#x662F;&#x65F6;&#x5019;&#x9047;&#x89C1;&#x81EA;&#x5DF1;&#x7684;&#x7075;&#x9B42;&#x4F34;&#x4FA3;&#x4E86;&#xFF0C;
&#x591A;&#x4E00;&#x4EFD;&#x6267;&#x7740;&#xFF0C;&#x591A;&#x4E00;&#x4EFD;&#x5305;&#x5BB9;&#xFF0C;&#x591A;&#x4E00;&#x4EFD;&#x7A33;&#x91CD;&#xFF0C;&#x5C11;&#x4E00;&#x4E9B;&#x7126;&#x8E81;&#xFF0C;&#x5C11;&#x4E00;&#x4E9B;&#x6B32;&#x671B;&#xFF0C;&#x5C11;&#x4E00;&#x4E9B;&#x9A84;&#x50B2;&#x3002;
2.&#x5C06;&#x70B9;&#x8BC4;&#x5238;&#x7CFB;&#x7EDF;&#x6253;&#x9020;&#x6210;&#x4E00;&#x4E2A;&#x7B80;&#x6D01;&#x5065;&#x58EE;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x591A;&#x82B1;&#x4E9B;&#x65F6;&#x95F4;&#x8865;&#x5145;&#x77E5;&#x8BC6;&#xFF0C;&#x540C;&#x65F6;&#x5B66;&#x4F1A;&#x5982;&#x4F55;&#x7BA1;&#x7406;&#x56E2;&#x961F;&#x63D0;&#x9AD8;&#x56E2;&#x961F;&#x4F5C;&#x6218;&#x529B;&#xFF0C;2016&#x5E74;&#x6210;&#x957F;&#x4E3A;&#x771F;&#x6B63;&#x7684;
&#x8D44;&#x6DF1;&#x4E92;&#x8054;&#x7F51;&#x5DE5;&#x7A0B;&#x5E08;&#x3002;
3.2016&#x5E74;&#x4E0B;&#x534A;&#x5E74;&#x5F00;&#x59CB;&#x62CD;&#x6CAA;&#x724C;&#xFF0C;&#x5982;&#x679C;&#x62CD;&#x4E2D;&#xFF0C;&#x4E70;&#x4E00;&#x8F86;&#x9AD8;&#x5C14;&#x592B;&#x6216;&#x8005;&#x901F;&#x817E;&#x3002;
4.30&#x5C81;&#x4E4B;&#x524D;&#x53BB;&#x4E00;&#x8D9F;&#x6B27;&#x6D32;&#x4E8C;&#x6218;&#x6218;&#x573A;&#x5FB7;&#x56FD;&#x6216;&#x6CE2;&#x5170;&#x3002;
5.&#x81F3;&#x5C11;&#x5199;6&#x7BC7;&#x6280;&#x672F;&#x535A;&#x5BA2;&#xFF0C;&#x4F5C;&#x4E3A;&#x4E00;&#x540D;&#x6280;&#x672F;&#x5DE5;&#x7A0B;&#x5E08;&#xFF0C;&#x5B66;&#x4E60;&#x65B0;&#x77E5;&#x8BC6;&#x4E0D;&#x80FD;&#x505C;&#x6B62;&#xFF0C;&#x535A;&#x5BA2;&#x662F;&#x6700;&#x597D;&#x7684;&#x603B;&#x7ED3;&#x5F52;&#x7EB3;&#x7684;&#x624B;&#x6BB5;&#x3002;
6.&#x5E26;&#x9886;&#x56E2;&#x961F;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x6280;&#x672F;&#x6216;&#x4EA7;&#x54C1;&#x7A81;&#x7834;&#xFF0C;&#x4E89;&#x53D6;&#x62FF;&#x5230;&#x516C;&#x53F8;&#x7684;&#x6700;&#x5F3A;&#x97F3;&#x3002;
7.&#x6539;&#x6389;&#x665A;&#x7761;&#x7684;&#x4E60;&#x60EF;&#xFF0C;&#x505A;&#x5230;&#x6BCF;&#x5929;11&#x70B9;20&#x524D;&#x4E0A;&#x5E8A;&#xFF0C;11&#x70B9;&#x534A;&#x524D;&#x7761;&#x89C9;&#x3002;
8.&#x51CF;&#x5C11;&#x5237;&#x670B;&#x53CB;&#x5708;&#x7684;&#x6B21;&#x6570;&#xFF0C;&#x7761;&#x524D;&#x770B;&#x4E9B;&#x6280;&#x672F;&#x6216;&#x8005;&#x5E8A;&#x5934;&#x706F;&#x8BFB;&#x7269;&#x6216;&#x8005;&#x542C;BBC&#x800C;&#x4E0D;&#x662F;&#x5237;&#x670B;&#x53CB;&#x5708;&#x3002;
9.&#x5F00;&#x53D1;&#x4E00;&#x4E2A;&#x7B80;&#x5355;IOS App&#x3002;
10.&#x5728;&#x65C5;&#x6E38;&#x6DE1;&#x5B63;&#xFF0C;&#x5F00;&#x8F66;&#x5E26;&#x7239;&#x5988;&#x4E0A;&#x6D77;&#x4E00;&#x5468;&#x6E38;&#x3002;

&#x4EE5;&#x4E0A;&#x66F4;&#x50CF;&#x662F;&#x63A5;&#x4E0B;&#x6765;&#x4E24;&#x5E74;&#x8981;&#x5B9E;&#x73B0;&#x7684;&#x613F;&#x671B;&#xFF0C;&#x52A0;&#x6CB9;&#x5427;&#x5C11;&#x5E74;&#xFF0C;&#x54E6;&#x5BF9;&#x4E86;&#xFF0C;&#x8FD8;&#x6709;&#x6700;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x70B9;&#xFF0C;&#x6512;&#x591F;&#x9996;&#x4ED8;&#xFF01;&#x3002;
</code></pre>
        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">


</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2016/01/03/hello-world/" title="Hello World" itemprop="url">Hello World</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="EdwardGuo" target="_blank" itemprop="author">EdwardGuo</a>
		
  <p class="article-time">
    <time datetime="2016-01-03T08:10:04.000Z" itemprop="datePublished"> 發表於 2016-01-03</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p>Welcome to <a href="http://hexo.io/" target="_blank" rel="external">Hexo</a>! This is your very first post. Check <a href="http://hexo.io/docs/" target="_blank" rel="external">documentation</a> for more info. If you get any problems when using Hexo, you can find the answer in <a href="http://hexo.io/docs/troubleshooting.html" target="_blank" rel="external">troubleshooting</a> or you can ask me on <a href="https://github.com/hexojs/hexo/issues" target="_blank" rel="external">GitHub</a>.</p>
<h2 id="Quick_Start"><a href="#Quick_Start" class="headerlink" title="Quick Start"></a>Quick Start</h2><h3 id="Create_a_new_post"><a href="#Create_a_new_post" class="headerlink" title="Create a new post"></a>Create a new post</h3><figure class="highlight bash"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">$ hexo new <span class="string">&quot;My New Post&quot;</span></span><br></pre></td></tr></table></figure>
<p>More info: <a href="http://hexo.io/docs/writing.html" target="_blank" rel="external">Writing</a></p>
<h3 id="Run_server"><a href="#Run_server" class="headerlink" title="Run server"></a>Run server</h3><figure class="highlight bash"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">$ hexo server</span><br></pre></td></tr></table></figure>
<p>More info: <a href="http://hexo.io/docs/server.html" target="_blank" rel="external">Server</a></p>
<h3 id="Generate_static_files"><a href="#Generate_static_files" class="headerlink" title="Generate static files"></a>Generate static files</h3><figure class="highlight bash"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">$ hexo generate</span><br></pre></td></tr></table></figure>
<p>More info: <a href="http://hexo.io/docs/generating.html" target="_blank" rel="external">Generating</a></p>
<h3 id="Deploy_to_remote_sites"><a href="#Deploy_to_remote_sites" class="headerlink" title="Deploy to remote sites"></a>Deploy to remote sites</h3><figure class="highlight bash"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">$ hexo deploy</span><br></pre></td></tr></table></figure>
<p>More info: <a href="http://hexo.io/docs/deployment.html" target="_blank" rel="external">Deployment</a></p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">


</div>




<div class="comments-count">
	
</div>

</footer>


    </article>







  <nav id="page-nav" class="clearfix">
    <a class="extend prev" rel="prev" href="/"><span></span>Prev</a><a class="page-number" href="/">1</a><span class="page-number current">2</span>
  </nav>

</div>
      <div class="openaside"><a class="navbutton" href="#" title="顯示側邊欄"></a></div>

<div id="asidepart">
<div class="closeaside"><a class="closebutton" href="#" title="隱藏側邊欄"></a></div>
<aside class="clearfix">

  


  

  

  <div class="linkslist">
  <p class="asidetitle">友情鏈接</p>
    <ul>
        
          <li>
            
            	<a href="https://coderq.com" target="_blank" title="一个面向程序员交流分享的新一代社区">码农圈</a>
            
          </li>
        
          <li>
            
            	<a href="http://wuchong.me" target="_blank" title="Jark&#39;s Blog">Jark&#39;s Blog</a>
            
          </li>
        
    </ul>
</div>

  


  <div class="rsspart">
	<a href="/atom.xml" target="_blank" title="rss">RSS 訂閱</a>
</div>

  <div class="weiboshow">
  <p class="asidetitle">新浪微博</p>
    <iframe width="100%" height="119" class="share_self"  frameborder="0" scrolling="no" src="http://widget.weibo.com/weiboshow/index.php?language=&width=0&height=119&fansRow=2&ptype=1&speed=0&skin=9&isTitle=1&noborder=1&isWeibo=0&isFans=0&uid=null&verifier=b3593ceb&dpc=1"></iframe>
</div>


</aside>
</div>
    </div>
    <footer><div id="footer" >
	
	<div class="line">
		<span></span>
		<div class="author"></div>
	</div>
	
	
	<section class="info">
		<p> 天青色等烟雨 <br/>
			而我在等你</p>
	</section>
	 
	<div class="social-font" class="clearfix">
		
		<a href="http://weibo.com/2176287895" target="_blank" class="icon-weibo" title="微博"></a>
		
		
		
		
		
		
		
		
		
		
	</div>
			
		

		<p class="copyright">
		Powered by <a href="http://hexo.io" target="_blank" title="hexo">hexo</a> and Theme by <a href="https://github.com/wuchong/jacman" target="_blank" title="Jacman">Jacman</a> © 2016 
		
		<a href="/about" target="_blank" title="EdwardGuo">EdwardGuo</a>
		
		
		</p>
</div>
</footer>
    <script src="/js/jquery-2.0.3.min.js"></script>
<script src="/js/jquery.imagesloaded.min.js"></script>
<script src="/js/gallery.js"></script>
<script src="/js/jquery.qrcode-0.12.0.min.js"></script>

<script type="text/javascript">
$(document).ready(function(){ 
  $('.navbar').click(function(){
    $('header nav').toggleClass('shownav');
  });
  var myWidth = 0;
  function getSize(){
    if( typeof( window.innerWidth ) == 'number' ) {
      myWidth = window.innerWidth;
    } else if( document.documentElement && document.documentElement.clientWidth) {
      myWidth = document.documentElement.clientWidth;
    };
  };
  var m = $('#main'),
      a = $('#asidepart'),
      c = $('.closeaside'),
      o = $('.openaside');
  c.click(function(){
    a.addClass('fadeOut').css('display', 'none');
    o.css('display', 'block').addClass('fadeIn');
    m.addClass('moveMain');
  });
  o.click(function(){
    o.css('display', 'none').removeClass('beforeFadeIn');
    a.css('display', 'block').removeClass('fadeOut').addClass('fadeIn');      
    m.removeClass('moveMain');
  });
  $(window).scroll(function(){
    o.css("top",Math.max(80,260-$(this).scrollTop()));
  });
  
  $(window).resize(function(){
    getSize(); 
    if (myWidth >= 1024) {
      $('header nav').removeClass('shownav');
    }else{
      m.removeClass('moveMain');
      a.css('display', 'block').removeClass('fadeOut');
      o.css('display', 'none');
        
    }
  });
});
</script>










<link rel="stylesheet" href="/fancybox/jquery.fancybox.css" media="screen" type="text/css">
<script src="/fancybox/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
$(document).ready(function(){ 
  $('.article-content').each(function(i){
    $(this).find('img').each(function(){
      if ($(this).parent().hasClass('fancybox')) return;
      var alt = this.alt;
      if (alt) $(this).after('<span class="caption">' + alt + '</span>');
      $(this).wrap('<a href="' + this.src + '" title="' + alt + '" class="fancybox"></a>');
    });
    $(this).find('.fancybox').each(function(){
      $(this).attr('rel', 'article' + i);
    });
  });
  if($.fancybox){
    $('.fancybox').fancybox();
  }
}); 
</script>



<!-- Analytics Begin -->



<script>
var _hmt = _hmt || [];
(function() {
  var hm = document.createElement("script");
  hm.src = "//hm.baidu.com/hm.js?e6d1f421bbc9962127a50488f9ed37d1";
  var s = document.getElementsByTagName("script")[0]; 
  s.parentNode.insertBefore(hm, s);
})();
</script>



<!-- Analytics End -->

<!-- Totop Begin -->

	<div id="totop">
	<a title="返回頂部"><img src="/img/scrollup.png"/></a>
	</div>
	<script src="/js/totop.js"></script>

<!-- Totop End -->

<!-- MathJax Begin -->
<!-- mathjax config similar to math.stackexchange -->


<!-- MathJax End -->

<!-- Tiny_search Begin -->

<!-- Tiny_search End -->

  </body>
 </html>
